{
    "chunks": [
        {
            "text_preview": "Once there were two friends named Ravi and Pawan in a village. Both of them left home and moved to many cities to earn good money by doing business. Once they found a box full of gold coins. Both of them left for home to share the money equally. They buried the box under a tree at the end of the village and went home because everyone would be suspicious if they took the box full of gold coins into the village. Did they become so rich if they went into the village with a box containing gold coins? They thought that the villagers would be jealous, so they came there at night and wanted to share equally.",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        },
        {
            "text_preview": "Pawan’s hope has increased among the two traders. He wanted to go and get the gold coins himself. One night Uri finally went, dug the ground and brought a box containing gold coins and hid it in his house. As the days passed Pawan went to Ravi saying let’s take the box of gold coins from the tree and said “Friend! Let’s get the box of gold coins buried under the tree at the end of the village.” Both friends went to the end of the village and dug where they had buried it. But there was no box of gold coins. When the box of gold coins was not found, Pawan turned around. (Cheater Long Story in English with Moral)",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        },
        {
            "text_preview": "“You scoundrel! Are you so deceitful? What will happen to the Box if you don’t steal it? You stole the Box of gold coins in advance without my knowledge and are acting like an innocent person who doesn’t know anything? Not even a third person knows what is buried here except you and me. Give me my share politely. Or the King will complain about you.” Pawan blamed Ravi and threatened him. Then Ravi said, “I don’t know what a box of gold coins is, I’m telling you the truth, there is nothing I can do. Do as you like, God is there for everything.”",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        },
        {
            "text_preview": "Pawan went to King and complained about Ravi. “King! We buried the box of gold coins under the tree. That tree is a witness, if you ask tomorrow, the tree will tell you the truth. Pawan begged him to conduct an investigation and give me justice. Everyone in the assembly was surprised that the tree was testifying to Pawan’s words. King said that they will investigate tomorrow. Pawan went home and said to his father, “Father! I stole the gold coins myself. If you do as I say, Ravi will be punished and the gold coins will be ours. We can live comfortably with them. The tree is tall enough to hold a man. In it you have to sit secretly without anyone knowing. When questioned by King tomorrow, he should say that Ravi stole the box of gold coins and Pawan knows nothing,” Pawan said. (Cheater Long Story in English with Moral)",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        },
        {
            "text_preview": "At first the father did not agree. After Pawan scolded him, the old man finally agreed. The next morning, Pawan’s father secretly hides in the trunk of a tree without anyone knowing. After that some elders and soldiers also came there along with King. The king looked at the tree and said, “O tree! He said, “Tell me who took the box of gold coins hidden in your ground.” The words “Ravi took the box of gold coins” were heard from the top of the tree. Ravi fumed, “King! There is some deception in this. Is there any place where the tree can bear witness? Test this tree well. Then give your verdict.”",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        },
        {
            "text_preview": "Immediately the king ordered the soldiers to look around the tree. They looked and said that there was a big hole at the top of the tree. “Put hay in that trunk and set it on fire,” King ordered. The soldiers did as King said. Fearing to die in the fire, Pawan’s father came out from under the tree. “King! Pawan’s father told the truth begging, “Forgive me.” King got angry. King punished Ravi for not only cheating his friend but committing theft and forcing the crime on his friend. (Cheater Long Story in English with Moral)",
            "source": "RagAPINew/tmp\\3a501877-6547-45c0-9d7f-e4ca49b5c208_common.txt"
        }
    ]
}