{
    "chunks": [
        {
            "text_preview": "SUDHA MURTY\nGRANDMA’S BAG OF STORIES\nIllustrations By Priya Kuriyan\nPUFFIN BOOKS\n\nContents\nThe Beginning of the Stories\n‘Doctor, Doctor’\nKavery and the Thief\nWho Was the Happiest of Them All?\nThe Enchanted Scorpions\nThe Horse Trap\nA Treasure for Ramu\nThe Donkey and the Stick\n‘What’s in It for Me?’\nThe Princess’s New Clothes\nThe Story of Paan\nPayasam for a Bear\nFire on the Beard\nThe Way You Look at It\nRoopa’s Great Escape\nFive Spoons of Salt\nHow the Seasons Got Their Share\nThe Island of Statues\nThe Kingdom of Fools\nThe Story of Silk\nWhen Yama Called\nThe Unending Story\nFollow Penguin\n\nCopyright",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Copyright\n\nPUFFIN BOOKS\nGRANDMA’S BAG OF STORIES\nSudha Murty was born in 1950 in Shiggaon in north Karnataka. She did her\nMTech in computer science, and is now the chairperson of the Infosys\nFoundation. A prolific writer in English and Kannada, she has written novels,\ntechnical books, travelogues, collections of short stories and non-fictional\npieces, and four books for children. Her books have been translated into all\nthe major Indian languages. Sudha Murty was the recipient of the R.K.\nNarayan Award for Literature and the Padma Shri in 2006, and the Attimabbe\nAward from the government of Karnataka for excellence in Kannada literature\nin 2011.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Author’s Note\nMy grandmother, Krishnaa, popularly known as Krishtakka, was very bright\nand affectionate. She was also a great storyteller. She never gave us any\nsermons but taught the values of life through her stories. Those stories and\nvalues remain with me even now. I spent my childhood carefree, stress-free,\nwith my cousins and grandparents at my hometown Shiggaon, a sleepy town\nin north Karnataka. We shared everything there, whatever we had, and that\nbecame a great bond among us cousins. The binding force was my\ngrandmother.\nI made some changes when I wrote the stories in this book but mostly it is a\ntrue reflection of my childhood.\nWhen my granddaughter Krishnaa was born, she elevated me to the\nposition of grandmother. I realized more than ever the importance of stories,\nand how much they help children to learn. Hence this book.\nI hope, with these stories, children and parents will understand the unique\nrelationship between three generations and will continue to create bonds of",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "relationship between three generations and will continue to create bonds of\nlove with one another and the older generations in their families.\nI would like to thank Penguin Books India, who are always eager to publish\nmy work. I would also like to thank Sudeshna Shome Ghosh, who became a\ngood friend apart from being my editor, in my journey of writing, in the last\ndecade.\nSudha Murty\nBangalore",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Read more in Puffin\nThe Magic Drum and Other Favourite Stories by Sudha Murty\nA princess who thinks she was a bird, a coconut that cost a thousand rupees,\nand a shepherd with a bag of words . . .\nKings and misers, princes and paupers, wise men and foolish boys, the\nfunniest and oddest men and women come alive in this sparkling new\ncollection of stories. The clever princess will only marry the man who can ask\nher a question she cannot answer; the orphan boy outwits his greedy uncles\nwith a bag of ash; and an old couple in distress is saved by a magic drum.\nSudha Murty’s grandparents told her some of these stories when she was a\nchild; others she heard from her friends from around the world. These\ndelightful and timeless folk tales have been her favourites for years, and she\nhas recounted them many times over to the young people in her life. With this\ncollection, they will be enjoyed by many more readers, of all ages.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Read more in Puffin\nHow I Taught My Grandmother to Read and Other Stories by Sudha Murty\nWhat do you do when your grandmother asks you to teach her the alphabet?\nOr the President of India takes you on a train ride with him?\nOr your teacher gives you more marks than you deserve?\nThese are just some of the questions you will find answered in this delightful\ncollection of stories recounting real-life incidents from the life of Sudha\nMurty—teacher, social worker and bestselling writer. There is the engaging\nstory about one of her students who frequently played truant from school. The\naccount of how her mother’s advice to save money came in handy when she\nwanted to help her husband start a software company, and the heart-warming\ntale of the promise she made—and fulfilled—to her grandfather, to ensure\nthat her little village library would always be well supplied with books.\nFunny, spirited and inspiring, each of these stories teaches a valuable lesson",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Funny, spirited and inspiring, each of these stories teaches a valuable lesson\nabout the importance of doing what you believe is right and having the\ncourage to realize your dreams.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "To Krishnaa, who has taken me back to my \nchildhood memories, from Sudha Ajji",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Beginning of the Stories\nSummer holidays! Ajji smiled to herself as she waited for two more of her\ngrandchildren to arrive. Raghu and Meenu would be here soon. Anand and\nKrishna had already arrived with their mother the previous evening. They had\nbeen waiting restlessly for their cousins to arrive ever since. Even though Ajji\ntold them Raghu and Meenu would be here the next morning, these two kids\njust would not listen. They went to the railway station with their grandfather,\nAjja, to receive them. The train must have pulled into the tiny railway station\nof Shiggaon by now, and their grandfather would have hired a taxi to bring\nthem home along with their mother and the stacks of luggage.\nAjji hurried through her bath. She had finished cooking their favourite\ndishes, and was now wearing a nice, soft cotton sari before going to the\nveranda to wait for them.\nThere! There they came! What a noise the children were making! They all",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "veranda to wait for them.\nThere! There they came! What a noise the children were making! They all\nnearly tumbled out of the car and came leaping and shouting to her, each\nwanting to be the first to be hugged by her. Each one wanted to be closest to\nAjji.\nSoon the children settled down. A visit to Ajji and Ajja’s house meant first\ninspecting the garden to see how much the plants had grown since they last\ncame. Then they went to check on the cows, calves, dog, pups, cats and\nkittens. Then they all ate huge quantities of Ajji’s delicious food. Finally,\nwhile their mothers went off to chat and rest, the children gathered around\ntheir grandmother for the best part of the holidays—listening to her wonderful\nstories, particularly in the late afternoon.\nLet us, too, gather under the fast revolving fan, on a mat on the floor,\nfighting to be nearest to her, and listen in.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Doctor, Doctor’\nThe first day, the children asked, ‘Ajji, how do you know so many stories?’\nAjji smiled and answered, ‘My grandmother told me many stories. Some I\nread in books. A few I learnt from youngsters like you, and the rest from your\nAjja.’ Then Ajji paused and said, ‘I see all of you have grown a lot since the\nlast time I saw you. So before I start telling any stories, I want to know what\neach of you want to be when you grow up.’\nRaghu, who was eleven years old, and the oldest of all, said immediately, ‘I\nwant to be an environment scientist.’ Meenu, who was nine, said, ‘I have not\ndecided, maybe a computer person like my dad.’ Anand, who was ten, said, ‘I\nwant to be an astronaut,’ and his twin sister Krishna firmly said, ‘I want to\nbecome a fashion designer.’ Ajji smiled. ‘I am glad all of you have thought\nabout this. We should always have some aim in life which we must try to\nachieve while being of help to others. Now let me tell you a story of a person",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "achieve while being of help to others. Now let me tell you a story of a person\nwho learnt just such a lesson.’\nShall we, too, join Ajji and her gang of young friends and hear the story?\nOn a blazing hot summer afternoon, an old man came walking down a narrow\nvillage path. He was tired and thirsty. Right by the road, he spotted a tiny\ngrocery store. It had a tin roof and mud walls. The shopkeeper sat inside\nfanning himself and shooing away the flies that were buzzing around in the\nstifling heat. There was a little bench in front of the store where the villagers\nmet when evening came and the land had cooled down. The old man flopped",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "down on the bench. He was so tired that for a while he could not speak.\nFinally, he opened his mouth and uttered one word, ‘Water!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Now, this village had been facing a horrible problem for a long time. It was\nnear a great desert and the rains came only once a year to fill its ponds and\nwells. But the rains had disappeared for the last two years, and the villagers\nhad been making do with water from a faraway stream. Every morning groups\nof men and women walked a long distance, filled their pots from the little\nstream and used that the whole day. Naturally, no one wanted to waste even a\ndrop of this precious water.\nYet how do you say no to a thirsty, tired old man when he asks for water?\nWithout a second thought, the shopkeeper, Ravi, who was very kindhearted,\npoured out a tumbler of water from his pot and gave it to the old man. The\nman drank it up greedily. Then he said one more word: ‘More!’ And without\nwaiting for Ravi to give it to him, he lunged for the pot, picked it up and\nlifting it to his lips drank up Ravi’s entire day’s supply of water!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "lifting it to his lips drank up Ravi’s entire day’s supply of water!\nPoor Ravi, what could he do? He just stared in dismay. Then he told\nhimself, ‘Never mind. After all, I did help someone in need.’\nThe stranger, meanwhile, now seemed to feel better. He handed the pot\nback to Ravi, gave a smile that filled Ravi’s heart with warmth and said, ‘My\nson, always be kind like this. Help everyone who comes to you like you\nhelped me, and you will be blessed.’ Then he picked up his stick and slowly\nhobbled down the road. Ravi watched the strange old man disappear into the\ndistance, then returned to his shop.\nThe afternoon heat grew worse. After a while Ravi felt his head was about\nto burst with a headache. His lips were parched and his throat hurt, it was so\ndry. He really needed a drink of water. But the visitor had finished it all up!\nHoping to coax a drop or two out of the pot, Ravi lifted it to his lips and tilted",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Hoping to coax a drop or two out of the pot, Ravi lifted it to his lips and tilted\nit. Imagine his surprise when a gush of water ran down his face! It was sweet,\nrefreshing water which not only quenched his thirst, but wiped out his\nheadache too.\nRavi was staring at the water pot, trying to figure out what had just\nhappened, when Karim limped into his shop. Karim was a young man who\nhad hurt his leg in an accident many years ago which had left him with a limp.\nWhen he was unwell or tired, his limp became worse. Karim, too, flopped\ndown on the bench in front of the store and caught his breath, like the old\nman. Then he fished out a shopping list from his pocket and handed it to Ravi.\nAs Ravi started packing up the items listed on the paper, Karim opened a little\nbundle of food and ate his lunch sitting on the bench. Finally he wiped his",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "mouth on his scarf and pointed to Ravi’s pot of water. ‘Mind if I take a little\nsip? It is so hot after all.’\nRavi was busy measuring out some dal. He said without looking up, ‘I\nwould be happy to offer you some, but someone’s already had most of it.\nThen I was feeling unwell and I think I finished the last of it.’\n‘What are you saying, my friend? I can clearly see the pot brimming over\nwith water!’\nRavi looked up and stared in disbelief. In front of his eyes, Karim poured\nout a tumblerful of water and drank it. Then he paid for all his groceries and\nleft the store.\nDid his limp look as if it was nearly gone? Ravi watched him for a while\ntrying to figure out, then decided the heat was playing tricks on his mind and\nwent back into the cool comfort of his shop and dozed off.\nHe woke with a start as someone was calling his name urgently. He opened\nhis eyes to find Karim back. This time he was holding by the hand his little",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "his eyes to find Karim back. This time he was holding by the hand his little\nsister Fatima. ‘Brother, wake up. We need your help,’ Karim urged.\n‘Wh-what? Is something wrong?’\n‘Fatima is burning up with fever!’\n‘Then go to a doctor, why have you got her to a grocery shop?’\nKarim stared at him and said, ‘You mean you don’t know how you just\nhelped me? My leg, which has been troubling me for the last many years,\nhealed up on its own as soon as I drank the water from your magic pitcher!\nGive Fatima a drink from it, too. I am sure her fever will disappear in no\ntime.’\nRavi was astounded. Magic pitcher? Healing water? What was Karim\ngoing on about? Nonetheless he passed the pot to Fatima. She drank a bit,\nthen sat down to rest. Within minutes she lifted her head and said, ‘It is true,\nbrothers! I am indeed cured of the fever!’\nSoon the news spread in the village like wildfire. Ravi, the quiet, kind\ngrocery storekeeper, was now the owner of a magic pitcher, the waters from",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "grocery storekeeper, was now the owner of a magic pitcher, the waters from\nwhich could heal anyone of any disease. Every night Ravi left the pitcher in\nthe store, and in the morning it would be filled to the brim with sweet, cool\nwater. Daily, a queue of sick people and their relatives collected in front of his\nshop. To each one Ravi gave a drink of the water, and they went away saying\nthey were now better. The pot was never empty. Ravi realized the old man he\nhad helped must have given him this gift in gratitude. Ravi understood what a\ngreat gift it was and thanked him daily in his mind.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Soon his little store turned into a hospital. Ravi did not charge a paisa for\nthe water. People would leave some money, some gifts for him, and others did\nnot pay him anything but he was still happy with that.\nOne day, a rich landlord’s servant appeared at his doorstep and said, ‘My\nmaster is unwell. Come with me and give him a drink of your water.’\nRavi replied, ‘See the crowd of people behind you, waiting for their turn.\nHow can I leave without helping them and go to your master? Do you think\nthese sick people can stand in the sun for long? Tell your master to come to\nme instead and I will give him the water here.’\nThe servant said, ‘Ravi, what will you get by helping these poor people? A\nfew rupees? Some rice and dal? Come to my master’s house. He will shower\nyou with money and gifts. Your worries about making ends meet will be over\nfor at least a month.’\nRavi was tempted. It was true, why not cure one rich man and get some",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "for at least a month.’\nRavi was tempted. It was true, why not cure one rich man and get some\nhelp in buying his daily needs? Ravi told the people waiting outside to come\nback the next day and went with the servant to the landlord.\nSlowly, in this way, Ravi changed. Where once he could not bear to see the\npain and sadness of the sick and poor people, he now started each day hoping\nhe would get one rich patient at least, who would pay him handsomely.\nDays passed thus. Seasons changed and it was summer once more. Ravi\nwas in his old store, writing up his accounts, when the voice of an old man\nquavered in his ear, ‘Son, water!’\nStartled, he looked up. Was it the same old man who had given him the gift\nof the magic pitcher? But right behind the visitor was none other than the\nking’s messenger. ‘Come quickly!’ the messenger shouted. ‘The queen has\nbeen bitten by a mosquito!’\n‘Water!’ the old man repeated.\n‘The queen is unwell!’ the messenger shouted again.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Water!’ the old man repeated.\n‘The queen is unwell!’ the messenger shouted again.\nRavi looked from one to the other. One was a grubby old man who may or\nmay not be the same person who gave him the pitcher. On the other side a\nmessenger from the king himself! He pictured the gold coins showering down\non him once his healing water soothed the queen’s mosquito bites. The choice\nwas clear.\nHe picked up his pitcher and said to the stranger, ‘Wait right here, Uncle,\nI’ll be back soon.’\nThe king’s swift-footed horses took him to the palace. There he rushed to\nthe queen who was staring in dismay at the mosquito bites on her arm. He",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "tilted the pitcher to pour some water into a tumbler, but nothing came! Again\nand again he tilted the pitcher. He turned it upside down and stared into its\ndepths. It was dry as a bone.\n‘You cheat!’ the king roared. ‘So this is how you have been fooling the\npeople of my kingdom! Get out, and never let me hear that you have acquired\nmagical healing powers. If you claim such a thing again I will banish you\nforever from the village.’ Then he turned to comfort his queen who was\nsplashing tears on the bump on her arm.\nRavi slowly walked back to his village. He went to his shop. No one was\nthere. He searched for the old man who had asked for water. He was nowhere\nto be seen. He called out, ‘Uncle, I am sorry. I made a mistake. Please do\ncome. I will give you water.’ But there was no reply. Now he realized this was\nthe same old man whom he met a year back.\nHe remembered the people he had healed once out of kindness and\ncompassion and how much they had blessed and loved him in return. He",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "compassion and how much they had blessed and loved him in return. He\nremembered their little acts of generosity, sparing him a few coins, a bundle\nof vegetables from their garden in return for the water. When did he become\nso selfish and greedy that he would neglect the people who had needed him\nthe most? The old man had taken back his powers when he sensed Ravi had\nmisused the gift.\nNever mind, Ravi smiled to himself. He would use the money he had\nreceived for the water to help bring a real doctor to the village, someone who\nwould help the people with his knowledge of medicines and diseases, so that\nthey need not wait for a magician to cure them of their illnesses.\nFrom that day onwards Ravi filled his pitcher with ordinary water from the\nstream and carried it back carefully to his little store and waited for the old\nman. Maybe one day he would be back, but till then, Ravi was determined to\nbring a real medicine man to his village.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "bring a real medicine man to his village.\nAjji finished her story and looked around at the four little faces around her.\nRaghu was deep in thought. Ajji smiled at him. Then the children shouted,\n‘Ajji, tell one more story!’\n‘Ah ha,’ Ajji said, ‘too many stories a day are not good either. One laddoo is\nvery sweet, very delicious but if you eat laddoos all the time it’s no fun. Go",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and play outside. Tomorrow I will tell you another story.’ With that she got up\nand went to the kitchen to supervise the dinner.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Kavery and the Thief\nThe children had gone with their Ajja to the paddy fields that morning. They\nwere all city kids and did not know a thing about farming! On the way, Anand\nwas surprised to see a bird’s nest on top of the tree. He said to Ajja, ‘I wonder\nhow birds decide where and how to make their nests!’ Ajja said, ‘The straw in\nthe nest is from the paddy field. Do you know, farming helps human beings as\nwell as birds?’ Krishna replied, ‘Ajja, I thought wheat and rice can be just\nplucked from trees, like mangoes. But today I realized there is so much work\nin farming.’\nThat afternoon, after lunch, when they gathered around Ajji for the day’s\nstory, she looked sharply at the children. They had enjoyed learning about\nfarming activities like cleaning seeds and separating the straw from paddy. In\nthe city everything came from the supermarket, but here they had seen how\nthings were really produced.\nAjji said, ‘Farming is very important. If farmers do not grow any food,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Ajji said, ‘Farming is very important. If farmers do not grow any food,\nwhat will we all eat?’\nAnand said thoughtfully, ‘If farmers do such important work, why are they\nso poor?’\n‘That’s true, my dear,’ Ajji sighed, fanning herself. ‘Of course there are rich\nfarmers too, people who own lots of land. But many in our country till small\npieces of land, and so make less money.’\nThen seeing the kids’ crestfallen faces, she put down her fan, sat up and\nsaid, ‘But I can tell you of a poor farmer woman who did not remain very\npoor. All due to her sharp wit!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Tell Ajji! Do tell!’ the kids yelled. So Ajji started her story.\nKavery’s lazy husband annoyed her no end. There she was working like a\ndonkey in the fields, ploughing and watering and tending a hard, dry piece of\nland, while her husband snored away happily at home! Why, once when a\nstranger came asking for some food and water, he just pointed towards the\nkitchen and went back to sleep. The stranger, thankfully, was an honest man\nand took only enough for himself and his horse. Not that there was much to\nsteal in Kavery’s little house. They were poor farmers with only a patch of\nland where nothing seemed to grow. Somehow Kavery tilled the land, did\nsome odd jobs in the neighbourhood, and made ends meet.\nThe land was right next to a temple. On some days her husband would\ncome along with her on the pretext of helping her, but no sooner would her\nback be turned than she would find him stretched out near the temple\ncourtyard gossiping with passing villagers.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "courtyard gossiping with passing villagers.\nOne day, as she was working in the field, trying to dig up the ground so she\ncould sow some seeds, a thin man with a big moustache appeared beside her.\nHe was a thief, and up to no good. Kavery, of course, did not know this. She\ngreeted him politely and went back to her work. Now the thief wanted to steal\nthe coins that were given as offerings in the temple and perhaps even the\nornaments on the idol. The only way into the temple was by digging his way\nin from Kavery’s land. But how could he do anything there, with this tough,\nno-nonsense woman working away?\nGuessing Kavery was hard up for money, he whispered to her, ‘Sister, why\nare you working so hard on this barren land? I will give you one thousand\nrupees, sell it to me.’\nKavery raised her eyebrows; why did he want to buy the land for so much\nmoney? Surely something was wrong . . .\nThe thief sensed she was not about to sell it to him, so he raised his price:",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The thief sensed she was not about to sell it to him, so he raised his price:\n‘A thousand and fifty? No? Two thousand? No again? FIVE THOUSAND?\nNo?’\nKavery kept shaking her head. She did not like this odd-looking man who\nwas offering her so much money for the field. Clearly he had some evil plans.\nFinally, to keep him quiet, she made up a story. ‘I will never sell this land.\nYou see, it belonged to my ancestors. Now we are poor, but I am told that\nonce our family was very rich. Though we lost a lot of our money, much of it",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "was also buried here, in this field by one ancestor, to keep it safe from\nrobbers. Then people forgot about it for years and years. My husband found a\nclue to the location of the hidden treasure just a few days back. Why do you\nthink I am digging this hard earth? Not to sow seeds, oh no, that’s just what\neveryone thinks. I am actually looking for hidden treasure!’\nThe thief was stunned. He felt this woman was really innocent, giving such\nimportant information to a stranger. He thought, why should I not take\nadvantage of this situation? Here he was, hoping to steal a few coins from the\ntemple, and this woman was telling him about hidden treasure! He replied in a\nvery humble way, ‘Yes sister, I understand; after all it is your family treasure.\nOnly you should get it.’ He pretended to walk away, and went and hid himself\na little way down the road.\nNight fell; Kavery packed up her tools and headed home. The temple, too,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Night fell; Kavery packed up her tools and headed home. The temple, too,\nemptied out and the priest locked it up for the night. Then at midnight, when\nall was quiet and the night creatures were coming out of their homes, the thief\ncrept into the field.\nAll night he dug and dug, looking for treasure, but of course there was no\nsign of it as there never had been any treasure to begin with! By the time\ndawn broke he realized Kavery had made a fool of him and all he could do\nnow was get away from the field fast.\nWhen Kavery reached the field she grinned to herself. Just as she had\nexpected, the thief had spent the night digging up the land nicely for her. All\nshe needed to do now was sow the seeds. She worked hard in the field for the\nnext few months and managed to grow a good crop. She sold those and finally\nthey had some money. With a part of this money Kavery bought some\njewellery.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Many months later, the thief decided to show his face in the village again.\nHe was careful to disguise himself, though. He trimmed his long moustaches,\ntied a colourful turban and pretended to be a travelling salesman. No sooner\nhad he stepped into the village than he saw Kavery going about her work. But\nwhat is this . . . Instead of the simple, unadorned lady he saw last year, she\nwas now wearing jewellery which looked as though it had been in the family\nfor years! Surely she must have located that missing treasure finally! He was\ndetermined to look in her house and find the rest of her money and treasure.\nThat night, he appeared at Kavery’s house and said to her husband, ‘I am a\ntraveller and don’t have a place to spend the night. Please give me shelter for\nthe night.’\nKavery’s husband agreed immediately. Kavery, however, glimpsed the man\nfrom inside the house and saw through his disguise. She knew he must be",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "from inside the house and saw through his disguise. She knew he must be\nplanning some robbery, so she said in a loud voice, making sure the visitor\nheard her, ‘Oh dear, your dear aunt is all alone at night and has asked us to\ncome stay with her. You know how the dark scares her when your uncle is not\nthere. Come, let us go there for the night.’ Then lowering her voice a bit, yet\nmaking sure she was heard clearly, she continued, ‘Don’t worry about the\njewels. I have hidden them in little holes in the house walls. No one will\nsuspect the hiding spot.’ Then she came out and in her normal voice told the\nthief, ‘Brother, you can sleep in the veranda. The house will be locked. Here\nis some food and water for you. We will come tomorrow morning.’ The thief\nsmiled to himself at Kavery’s foolishness.\nHer husband, meanwhile, stared at her with an open mouth, wondering\nwhich aunt and what jewels she was talking about. When she firmly walked\noff, he followed obediently.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "off, he followed obediently.\nThe thief could not believe his luck. He had the entire night to comb\nthrough the house, tap all the walls and look for the hidden stash of gold\nornaments. So he started. Tap tap tap. Kick, punch and shove. He prowled and\nhe tapped, he kicked and he pushed the walls, hoping to spot the jewels.\nFinally he tore down all the walls. But, of course, there was nothing he could\nfind. Exhausted he fell asleep and woke only with the crowing of the cock as\nthe sun rose. Quickly he found his little bundle of things and ran off. Within\nminutes Kavery and her husband returned.\n‘Oh Kavery, see what the bad man has done to our house! You gave him\nfood and shelter and made me come with you leaving the man alone in the\nnight,’ her husband wailed. But Kavery was smiling! Then she broke into",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "peals of laughter and said, ‘Don’t worry. I had planned this all along. You see,\nI saved money from our last crop to rebuild the house. I needed to call in\nsome labourers to help tear it down, but our guest has done it for us! Now we\ncan make a larger house for ourselves, just the way we always wanted.’\nThe whole village heard the story and started marvelling at her intelligence.\nMany months flew by. The thief was burning to take revenge. How dare that\nvillage woman trick him, that too not once but twice! He realized that she was\nvery clever.\nOne day, he dressed up as a bangle seller and started wandering in the\nvillage. Kavery spotted him and knew who he was at once. She said to her\nfriends who were crowding around the bangle seller, ‘Oh dear, I would have\nloved to get some for myself. But ever since that good-for-nothing thief tried\nto steal all our money by tearing down our house, I have hidden everything in\na little hole in a tree in the woods.’\n‘Which tree?’ her friends asked.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "a little hole in a tree in the woods.’\n‘Which tree?’ her friends asked.\n‘Oh no, I am not saying which tree, but it is at last safe and sound out in the\nforest.’\nThe thief looked at her. Yes Kavery was wearing an ordinary sari with no\nornaments at all.\nHer friends turned around in astonishment at the crash with which the\nbangle seller flung down his collection of bangles and made off for the forest.\nOnly Kavery watched with a grin on her face.\nOut in the forest, the thief searched high and low for the jewels. He\nclimbed trees, poked around in bushes, got bitten, scratched and growled at,\nbut he would not give up. The jewels were there somewhere and he had to\nfind them.\nSo that is where we will leave him, prowling around in the forest, looking\nfor money and gold that don’t belong to him. Everyone praised Kavery for\nher quick wit in ridding the village of the thief. She continued to work hard\nand made more money from her farming and became a rich old lady. Even her",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and made more money from her farming and became a rich old lady. Even her\nhusband was shamed into giving up his lazy ways and helping her. As for the\nthief, who knows, perhaps he is still in that forest, looking for what was never\nhis. Now if only he had learnt to work hard like Kavery—he would have been\nas rich!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The children laughed and laughed when the story was over. ‘The poor thief!’\nMeenu and Krishna giggled. ‘Maybe he got eaten by a tiger!’\nAjji grinned. ‘See,’ she told Anand, ‘sometimes with a bit of luck and lots\nof pluck, people can change any situation in which they find themselves!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Who Was the Happiest of Them All?\nMeenu was upset. She pouted and sulked and would not talk to Ajji. But\nhow can any child be angry with Ajji for very long? Their grandmother was\njust too loving and affectionate for anyone to not tell her what was wrong.\n‘Ajji, it’s been three days, and you have not told a story about a king yet!’\nMeenu grumbled.\nAjji nodded. ‘It’s true, Meenu. That was my fault; I should have told you a\nstory about a king right away!’\n‘And I want a good, nice king, who does good, nice things for his people—\nnot horrible things like punishing them and jailing them,’ Meenu sat straight\nand demanded.\n‘All right, dear. Here’s a king, just as you wanted . . .’\nAnd Ajji began her story.\nKing Amrit loved his people and looked after the affairs of his kingdom well.\nHis minister, Chandan, was a wise man who helped the king in his work\ntirelessly.\nOne day, King Amrit and Chandan were taking a walk on the terrace of the",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "tirelessly.\nOne day, King Amrit and Chandan were taking a walk on the terrace of the\npalace. The terrace offered beautiful views of the surroundings, and they\ncould see far into the distance. They spotted the weekly market from up there,\nwith people in colourful clothes buying and selling all kinds of things. There\nwas plenty to buy and people had money to buy, too. There were no poor\npeople to be seen anywhere. The king watched with a smile on his face. He",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "was delighted to see the prosperity of his kingdom. Like any good ruler he\nwas happy when his people were happy.\nHe turned to Chandan and said, ‘See how contented my people are. But I\nwant to check this first-hand by talking to them. Tomorrow, summon people\nfrom all walks of life to the court, and I will ask them myself how they are\ndoing.’ Chandan was used to the king’s strange requests, so he nodded and\nwent off to carry out this order.\nThe next day, the king arrived in court humming a happy tune to himself.\nSeeing all the people gathered there waiting for him, he was even more\npleased. He cleared his throat and said in a loud voice, ‘I have called you here\nto ask you a very important question. As your king, I need to know if all of\nyou are contented. Do you have enough for your needs? Do you know anyone\nwho is not happy about anything?’\nThe citizens looked at each other, thought for a while and slowly one by",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The citizens looked at each other, thought for a while and slowly one by\none they came forward to answer. One after the other they all said how happy\nthey were—their kitchens had enough food, their trades and businesses were\ndoing well, the king had made them feel safe. The farmers had grown good\ncrops and the rivers and ponds were full of fish. What more could they ask\nfor?\nThe king became more and more pleased as he heard this. Only Chandan,\nhis minister, watched and heard everything with a frown on his face. Why?\nWhat was wrong? Soon he walked up to the king and whispered something in\nhis ear. King Amrit’s eyebrows rose up in astonishment. Surely, Chandan\ncould not be serious! But he looked at the minister’s face and found no trace\nof this being a joke.\nHe turned back to the court and made a most unusual announcement. ‘I am\ndelighted that all of you have said you are happy. But I want to test this.\nTomorrow, I want all the happy people of this kingdom to come and meet me",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Tomorrow, I want all the happy people of this kingdom to come and meet me\nin the royal gardens. But I have a condition. All of you will have to enter the\ngarden from the main gate, walk across and meet me by the gate at the rear of\nthe garden. I will wait for you there. When you enter the garden you will be\ngiven a sack each and you can pick whatever fruits or flowers your heart\ndesires.’\nAn excited buzz broke out among the crowd. It sounded like a lot of fun.\nNo one was usually allowed to enter the king’s special garden. He had planted\ntrees from all over the world in that garden and it was said to be filled with all\nkinds of beautiful and strange plants.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Right on time the next day, everyone gathered at the gate of the garden. At\nthe time the king had told them, the guards opened the gates and handed out\nthe sacks. Men, women and children started roaming around the beautiful\ngarden. They spotted juicy apples and plump mangoes hanging from trees.\nThey picked these till they saw ripe pomegranates bursting with juice, grapes\nand colourful flowers no one had seen before. People went about picking\nwhatever they wished for and filling their sacks with them.\nBut as they walked further into the garden it became wilder, more like a\nforest, and there they saw trees laden with apples of gold, mangoes of silver\nand flowers studded with gems and jewels!\nEveryone emptied their sacks of the fruits they had collected earlier and\nstarted madly filling them up with these precious fruits and flowers. They all\nforgot that they had said they had more than enough for their needs at home.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "forgot that they had said they had more than enough for their needs at home.\nGreed took over, their minds and all they could think about was adding more\nand more valuables to their sacks. The fruits which they had picked earlier,\nand had tasted to be as sweet as nectar, now lay in heaps around the garden—\nforgotten and left to rot.\nThen with their sacks filled right to the top, the citizens made their way to\nthe rear gate of the garden where the king was waiting. But what was this? To\ntheir astonishment they found a raging stream stopping their way. Water\ngushed down from behind some rocks and rushed over pebbles and big\nboulders through the garden. The stream was narrow, but the current was\nstrong. There were no boats to take the people across. Clearly, the only way\nwas to swim. But how could they swim with such heavy sacks filled with gold\nand silver fruits?",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The people stood by the stream for a long time scratching their heads. Then\none young man did what they all knew needed to be done. He simply\nabandoned his sack by the stream, waded into the water, then swam across to\nthe other side. Slowly the others, too, followed suit. Sadly, some wailing in\ndistress, they left their sacks filled with what they had thought was the riches\nof a lifetime, and dived into the stream. Then they walked up to their king—\nwet, unhappy and angry.\nKing Amrit and Chandan watched them trudge up in their soaking clothes.\nChandan had a small smile on his lips, while the king looked sad. When they\nhad assembled in front of him, he said, ‘When I asked you yesterday if you\nwere happy with your lives, all of you said you were contented and did not\nneed anything more. Yet, today I can see the sadness in your faces when you\nhad to leave behind the riches you had gathered in my garden. If you were",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "had to leave behind the riches you had gathered in my garden. If you were\nreally happy with your lives, why did you gather the jewel fruits, and why are\nyou so sad now?’\nEveryone looked down, ashamed at their behaviour. Only the young man\nwho was the first to cross the stream after leaving his sack behind seemed to\nbe unconcerned. Chandan spotted his cheerful face in the crowd and\nbeckoned him forward. Then he asked, ‘Tell me, are you not sad you had to\nleave behind so much of wealth that suddenly came your way?’\nThe man said, ‘I didn’t pick the jewelled fruits and flowers. I had picked\nsome of the lovely, tasty fruits and had eaten my fill of them. In my sack I had\nkept some others for my little daughter who is at home. I had thought she\nwould enjoy these tasty apples and mangoes. But when I saw there was no\nother way to go across the stream, I did not think twice about leaving my sack\nby the river. My little girl can get tasty fruits from some other garden, too!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "by the river. My little girl can get tasty fruits from some other garden, too!\nBut I am so happy the king let us all wander around his garden, looking at the\ntrees and plants and animals. He is a great king for having created this place\nof beauty, and it was a pleasure walking around there.’\nFinally a smile appeared on King Amrit’s face. Chandan turned to him and\nsaid, ‘Your Majesty, I hope you now realize that people’s contentment does\nnot end with having enough food or money. They also need to be truly happy\ninside. Only then will they not be swayed when they gain or lose wealth. That\nis a lesson that everyone—whether a king or a commoner—needs to\nremember.’\nThe king nodded, as did his subjects. This was a lesson they would not\nforget in a hurry!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Did you like the story, Meenu?’ Raghu asked.\n‘Oh yes,’ Meenu nodded. ‘But I liked the minister more than the king!’\n‘That’s true, Meenu,’ Ajji agreed. ‘Kings did need intelligent ministers to\nshow them the right path sometimes. Remember Akbar had Birbal, and\nKrishnadevaraya had Tenali Rama? Why just kings, we all need someone to\ntell us if what we are doing is wrong. It could be our parents, grandparents,\nteachers or even our best friend. The important thing is to listen to them and\nchange our ways when needed.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Enchanted Scorpions\nWhat an exciting morning the children had had that day! Ajja had asked for\ntheir help in cleaning up his old storeroom. Ajja loved to keep all kinds of old\nthings in that room, much to Ajji’s annoyance. She firmly believed the room\nwas the principle attraction for all the cockroaches, mice, termites and other\nsuch bugs in the house. Every summer holiday the children spent a day\nclearing out the room, exclaiming over all the treasures they had unearthed.\nAjja even let them keep some of the odds and ends they found. That didn’t\nplease their mothers too much though!\nToday they had found an old wooden box. It was a big box, beautifully\ncarved all over with flowers, and vines and leaves. Inside, it had little\ncompartments to keep all manner of things. Now these compartments were\nempty, but Raghu, who had been reading Treasure Island, imagined that once\nthese were full of gold and silver coins, gems as big as eggs and all kinds of\nfantastic jewels.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "these were full of gold and silver coins, gems as big as eggs and all kinds of\nfantastic jewels.\nAfter examining the box thoroughly, the children decided that the day’s\nstory had to be about lost treasure. Ajji, who knew a story about anything\nunder the sun, started right away.\nSiddharth was a young, good-natured merchant. Looking for work, he arrived\nin a village. He liked the people of the village so much that he decided to use\nall his savings, buy a house and live there forever. While searching for a\nhouse, he met Uday.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Uday was a poor man. His family had once been extremely wealthy\nlandowners but were now not so well off. Uday was looking to sell his old\nfamily mansion in order to pay off his family’s loans.\nSiddharth loved the house Uday showed him and bought it immediately.\nThen he set about repairing the mansion, which was in ruins. As he dug out\nthe old flooring, he found a sealed box buried underground. When he opened\nit, to his surprise, he saw it was filled with scorpions. He flung the box away\nin fright.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "That evening, he went to visit the wisest man in the village and asked him\nabout the box of scorpions. The wise man thought for a while, then said,\n‘Perhaps Uday’s ancestors hid some money in that box and buried it, to be\nused when someone in the family needed the money. Over the years they\nmust have forgotten about the existence of the box.’\nSiddharth was still puzzled. ‘But the box contained scorpions,’ he said, ‘not\nmoney.’\nThe old man smiled. ‘The box is protected by an old spell. If it is opened\nby anyone other than a family member, it will appear as if it is swarming with\nscorpions. Only a true family member will be able to see that the box contains\nmoney.’\nSiddharth was sad to hear this story. He remembered the tears that had\nsprung up in Uday’s eyes as he had looked back at his ancestral house for one\nlast time before leaving the village. If only he had known about the hidden\ntreasure, he would not have had to sell the house. When Siddharth reached",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "treasure, he would not have had to sell the house. When Siddharth reached\nhome, he decided to keep the box safely till someone from Uday’s family\ncame to claim it. To make sure that the box was taken only by a true\ndescendant of Uday’s family, he took four scorpions from the box and hung\nthem in four corners of his newly opened shop.\nAll his customers would comment when they entered the shop. ‘Siddharth,\nare you mad? Why have you hung dangerous insects in your shop? Do you\nwant to scare away shoppers?’\nSiddharth would only smile. He knew his goods were the best for miles\naround, and people would come to shop at his store, scorpions or not.\nGradually the shop came to be known as the Scorpion Shop and the villagers\nlaughed at him behind his back. But Siddharth did not care.\nMany years passed. Siddharth was now a middle-aged man with a wife and\nchildren and enough money. But he had one regret. No one had come to claim\nthat box.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "children and enough money. But he had one regret. No one had come to claim\nthat box.\nOne day, a young boy walked into the shop and said, ‘Sir, I have heard\nfrom many people in the village that you are wealthy and often help those in\nneed. I had to stop going to school because I could no longer pay my fees.\nCould you please lend me some money so I can finish my studies?’\nSiddharth shook his head sadly. ‘The villagers have exaggerated about my\nwealth,’ he said. ‘Yes, I am earning enough, but not so much that I can help\nyou or lend you money, though I would have loved to do so.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The boy flared up in anger when he heard this. ‘Sir, if you do not want to\nhelp me, please say so openly. Why do you lie? You have so much money that\nyou don’t know what to do with it. Why else have you hung gold coins in the\nfour corners of your shop? Surely you can spare some coins to help a poor\nstudent like me.’\nSiddharth stared at him in astonishment. ‘Wh-what? What did you just\nsay?’ he asked, his eyes bulging in excitement.\n‘I said if you don’t want to help . . .’ the boy repeated.\n‘Yes, yes, I heard that,’ Siddharth cut him short. ‘But what did you say after\nthat, about the gold coins in my shop?’\nThe boy now looked at Siddharth doubtfully, afraid that perhaps this\nexcited old man was a bit mad. ‘I said you are so wealthy that you have hung\ngold coins in the four corners of the shop. There they are, for the world to\nsee!’ And the boy pointed to what appeared to Siddharth as four writhing\nscorpions.\nSiddharth gave a happy whoop of laughter. He rushed forward and hugged",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "scorpions.\nSiddharth gave a happy whoop of laughter. He rushed forward and hugged\nthe boy.\n‘Are you related to Uday Kamalakar? Did your family ever live in this\nvillage?’ he nearly shouted into the boy’s ears.\nThe young man stepped back in alarm. Perhaps this rich man was mad and\ndangerous after all. ‘Y-yes, my name is Uday. I was named after my\ngrandfather. His family lived here for many generations. Then, when they fell\non hard times, my grandfather sold his old house and moved. He never\nrecovered from the grief of having to sell his ancestral property and died\nheartbroken.’\nSiddharth wiped away the tears from his eyes. ‘Wait here, my son,’ he said.\nRushing to his house, he came back with the old box and gave it to the young\nboy. ‘Go on, open it and tell me what you see,’ he chuckled.\nThe boy opened the box and his eyes nearly fell out of his head. For he held\nin his hands more treasure than he could dream about in his wildest fantasies.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "in his hands more treasure than he could dream about in his wildest fantasies.\nThe box was filled with gold and silver coins and jewels!\nHe looked up in astonishment at Siddharth, who was grinning broadly.\n‘Yes, it belongs to you,’ Siddharth explained. ‘I have held it safe for many\nyears, hoping someone from Uday’s family will come to claim it. Your\ntroubles are now over. Go home, use the wealth of your ancestors judiciously\nand do well in life.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Then he told the boy the story of how he had found the box which appeared\nto be filled with scorpions to anyone who did not belong to Uday’s family.\nUday was amazed when he heard the story. He offered Siddharth half his\nwealth in gratitude. But Siddharth would hear none of it. ‘This is yours,’ he\ninsisted. ‘Go, enjoy your life.’\nUday went away with the box, and all his life he remembered the funny,\nhonest old man who had kept his wealth safely for him.\n‘How lovely, Ajji!’ Krishna gasped. ‘If only we had such a shopkeeper in this\ntown!’ All the children agreed that that would have been such fun. Ajji\nlaughed at their dreamy faces. Then she shooed them out to play in the\ngarden. And do you know what they played till late in the evening? Treasure\nhunt, of course!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Horse Trap\nThe next day, there was a surprise summer shower. The land smelled\nbeautiful. The thirsty earth had soaked in every drop of rainwater. The\nchildren had been very busy shifting the puppies and kittens, who were\nroaming in the back and front yards, into the house so that they did not get\ndrenched in the rain. Their respective mothers were very busy shifting the\npappadams left to dry on the terrace. Summer is the season when, under Ajji’s\nleadership, pickles and pappadams were made.\nMeenu started a calculation. ‘Everyone needs at least five pappadams per\nday. For the next one month 600 pappadams will be needed. Tomorrow our\nneighbour Vishnu Kaka’s three grandchildren are coming. They will also eat\nwith us these tasty pappadams. We may have to keep five per head . . . That\nmeans Ajji has to prepare 600 + 50 pappadams.’ When Ajji listened to\nMeenu’s mathematics, she laughed and said, ‘Don’t calculate that way. It may",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Meenu’s mathematics, she laughed and said, ‘Don’t calculate that way. It may\nbe true today that we will all eat five pappadams a day, but this may not be\ntrue for every day. After eating pappadams for three days, one may get bored.\nThere is a wedding in my brother’s house and we all might go there. So we\nmay not eat any pappadam those days. The way you are calculating, reminds\nme of the man who calculated the number of horses, once in England . . .’\nAll the children immediately gathered around her. ‘Oh Ajji, you must tell\nus this story of how the horses were counted.’\nSo Ajji had to stop what she was doing right there and tell them the story.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Many many years ago, in England, there lived a great thinker and scholar\ncalled George Smith. He thought a lot about how it would be in the future,\nand advised the prime minister about many things. He researched how many\npeople would live in the country in twenty years’ time, he calculated how\nmany schools, hospitals and roads needed to be built, or how much food\nneeded to be grown or bought from other places to feed all these people.\nHis calculations helped the government immensely in planning for the\nfuture.\nGeorge often needed to visit the prime minister’s office to talk to him about\nsome new project and advise him. One day, the prime minister had invited\nhim for a meeting, so he hopped into his horse carriage and set off for the\noffice. Now George was always deep in thought and rarely noticed what was\nhappening around him. Today, too, he sat in his carriage thinking about farms\nand ships and houses. But suddenly his carriage stopped with a jolt and he",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and ships and houses. But suddenly his carriage stopped with a jolt and he\nwas shaken out of his thoughts. There was some commotion on the road and\nall carriages had stopped around him. Normally George would have just sunk\nback into his thoughts again, but today something stopped him. A horrible,\nstrong smell. A smell that hung in the air and made you cover your nose with\na hanky if you were not a scholar wrapped up in your own world.\nToday, somehow, George was not able to disconnect himself from what was\ngoing on around him. The smell kept wafting into his nose and taking his\nmind away from the problem he was tackling. He called out to his coachman,\n‘Hi John, what is this extraordinary smell?’\nJohn the coachman was used to his master’s absent-minded ways, and he\nreplied briefly, ‘Horse dung.’\nHorse dung! Now that was something George had never given a thought to.\nSomehow, he could now think of nothing else. Soon his carriage pulled up in",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Somehow, he could now think of nothing else. Soon his carriage pulled up in\nfront of the prime minister’s office. But George kept sitting inside, lost in\nthought. Finally John tapped on the window to tell his master that they had\nreached their destination.\nGeorge walked to the visitor’s room still thinking. He was sitting there,\nreflecting on horses and their dung, when the prime minister’s secretary came\nto meet him. Now Adam, the secretary, was not as learned as George, but he\nwas very sharp and intelligent. He greeted George and said to him\napologetically, ‘The PM had to make time for another important meeting, and\nwill be late in seeing you. I hope you don’t mind waiting.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "George kept staring out of the window, watching yet more horse-drawn\ncarriages rushing up and down the road. Thinking he had perhaps not heard\nhim, Adam cleared his throat and repeated loudly, ‘Mr Smith, the PM . . .’\n‘Yes, I heard you, Adam,’ George mumbled.\nWorried that this great thinker of the country was in some trouble, Adam\nasked gingerly, ‘Is something bothering you? Perhaps I could help . . .?’\nGeorge looked at him excitedly, ‘You know, I just looked into the future\nand realized we will all die in about a hundred years. Our country will be\ndestroyed, our way of life gone forever. And do you know why? All because\nof horses . . . and their dung!’\nAdam stared at George, puzzled. Surely he could not be serious?\nGeorge continued, ‘See, now we use horses as the principal mode of\ntransport in the country. They are used to draw carriages, in the king’s stables,\neven in the farms.’\nAdam nodded. This was true.\n‘So how many horses are there now? Let’s assume that there are 500 rich",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Adam nodded. This was true.\n‘So how many horses are there now? Let’s assume that there are 500 rich\nfamilies who can afford to own a horse carriage. If each family has at least\ntwo children and all of them are rich enough to own carriages, that will mean\na minimum of two more carriages in a few years. Each carriage would require\ntwo horses. So, each rich family would be using four horses at the least. So\nthen there will be 2,000 horses. If you add our king’s cavalry, and the number\nof horses in the farms, the numbers increase substantially.’\nAdam nodded. Yes, this sounded true enough, but what was George’s\npoint?\n‘How do we get rid of the dung they generate now?’\nAdam answered patiently, ‘We dig pits and empty the dung into them.’\nGeorge nodded, ‘Now that’s my point. Imagine the scene a hundred years\nfrom now. 2,000 horses would have increased to 400,000, given the way the\npopulation is increasing. This will mean more dung! And what will we do",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "population is increasing. This will mean more dung! And what will we do\nwith all this dung? Humans will need more space and houses and farming to\nsustain themselves. Where will we find open land to dig up and bury the\ndung? It will lie unattended everywhere and cause horrible diseases. If they\nmake their way into the water sources it will be even worse. We will end up\npoisoning ourselves and our environment. We will become sick, and our\ncountry will become poor just by tending to so many sick people, and finally\nour way of life will just die out—as we all will. All because of horses!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Adam sat and thought about this for some time. George’s thoughts and the\ngrim picture he had painted of the future was scary indeed. But . . . here\nAdam’s practical thinking kicked in; what if things did not work exactly the\nway George was seeing it? He turned to his friend and said, ‘Mr Smith, you\nare not taking into account one very important bit into your calculations—the\nability humans have to innovate and adapt. Many years ago there were no\ncarts or carriages, we went everywhere by foot. Then once we started\ndomesticating animals we realized we could use them for transport too. But\ndo you think humans will rest with this achievement? Who knows, in a\nhundred years what other modes of transport we would have invented so that\nwe may not require horse for transport at all. Perhaps we will even be able to\nfly like birds!’\nGeorge never solved this problem in his lifetime. Neither did Adam live to\nsee how true his thoughts about the future had been. Man went on to invent so",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "see how true his thoughts about the future had been. Man went on to invent so\nmany new ways of moving from place to place that horses are no longer used\nin the numbers they once were. James Watt invented the steam engine, which\nled to the invention of railways. Then cars were invented by Karl F. Benz and\nbecame widely used in cities for transport. Finally the Wright brothers\nshowed that humans could fly—in aeroplanes! With all these great inventions,\nthe horse and other animal-drawn carts and carriages are now a thing of the\npast.\nTruly, if man did not innovate and experiment, our species would have died\nout—just like George had predicted!\nEveryone was very happy this story. They all teased Meenu. ‘You are the\nGeorge Smith of our house. Who knows one day nobody will eat pappadams\nand Amma may not prepare that many pappadams. We may even buy directly\nfrom the shops if it is a small number.’\nMeenu felt very embarrassed. She hid her face with a pillow. Ajji said,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Meenu felt very embarrassed. She hid her face with a pillow. Ajji said,\n‘Don’t make fun of her. Foresight is very important. If you don’t have\nforesight, then you will land up in trouble like Ramu.’\n‘Who is Ramu?’ the children immediately asked Ajji.\n‘I will tell the story of Ramu only tomorrow.’ And Ajji bustled off. The\nchildren knew she would tell only one story a day, so they eagerly waited for\nthe next day to hear Ramu’s story.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "A Treasure for Ramu\nVishnu Kaka’s grandchildren had come to visit him. Vishnu Kaka was a very\ngood friend of Ajja’s. They had lived next door to each other for years.\nUnfortunately, his wife Vasanthi Kaki had died a few years back. Though\nthere was a cook, his grandchildren—Sharan, Suma and Divya—always\npreferred to eat in Ajji’s house, which Ajji also welcomed.\nWith seven hungry children to feed, Ajji realized telling a story would be a\ngood way to keep them quiet till the food got cooked. Ajji started the story\nwhile peeling the cucumbers.\nDid you know that sometimes even the gods in heaven can get into an\nargument? That’s what happened once when Lakshmi, the goddess of wealth,\nfound herself cornered by all the other gods. Together, they accused her of\none thing—that she never stayed in one place for too long! ‘No sooner are\nyou comfortably settled in one house, do you decide to leave it, and off you\ngo elsewhere!’ they said to her.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "go elsewhere!’ they said to her.\nLakshmi sniffed and said, ‘That’s not true. I stay in a house as long as I am\nwelcome. If people think ahead, work sincerely and spend money wisely, I\nstay with them forever. Unfortunately often when I am in one place for a\nwhile, people behave strangely, and I have no choice but to leave.’\nThe other gods pooh-poohed this and refused to believe her. Poor Lakshmi\ndecided she needed to show them proof of what she had just said. Here is\nwhat she did to show that she was correct. Remember, many human years",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "make only a second in god years. So what took years to happen on earth, the\ngods could see in only a few minutes.\nRamu and Rani were farmers. They worked hard in their fields and earned\nenough money to feed their children and meet their other needs. They were\nnot rich and sometimes had to make do with fewer new clothes and not very\nnice food.\nOne day, Rani was digging a corner of her garden in order to plant a tree.\nAs she dug deeper, there was a loud clang! Her shovel had hit something\nmetallic hidden underground. Excited, she dug faster, till she pulled out a\nlarge metal box. When she opened it she could not believe her eyes. It was\nfilled with gold and silver jewels! For a while Rani stood dumbstruck. Then\nshe did a happy whoop and ran home with the box under her arm.\n‘Ramu, Ramu, see what I found buried in our garden!’ she yelled.\nRamu was writing up the accounts for the month, and for a while paid no\nattention to his wife. Only when she came up to him and did a happy jig",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "attention to his wife. Only when she came up to him and did a happy jig\naround him did he look up. Imagine how his mouth fell open in surprise when\nhe saw the box of jewels.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Soon Ramu and Rani were the richest people in the village. They stopped\ngoing to work—after all, what was the need, they told each other. Why work\nin the hot sun when they had piles of money at home? They left their small\ncottage and moved into the biggest house in the village. They had servants\nwho worked day and night doing every small job, so the two did not need to\nlift even a finger. There was a cook who cooked delicious meals, a person to\nserve it, another just to clean shoes and one person to even fan Ramu as he sat\non his bed the whole day and gossiped with his newfound friends.\nThen Ramu decided village life was too boring and they moved to the big\ncity. There they had another big house, more servants and lots of fun at\nvarious parties. Slowly they forgot the good things that had once made them a\nwell-loved family. They forgot to work hard, to help others in their need, or to\njust be nice people. They thought that with money they could buy anything,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "just be nice people. They thought that with money they could buy anything,\nincluding respect. They behaved rudely to others. They spent more and more\nmoney on clothes and parties, and as they did no work at all, the money\nstarted dwindling. They started borrowing from others which they soon could\nnot pay back.\nOne day, Ramu looked sadly at his account book. It was now filled with\nnumbers that showed he only needed to pay others; there was hardly anything\nleft for himself. In a heavy voice he called out to his wife, ‘Rani dear, the\ngood days are over. I think we forgot to be the kind of people Goddess\nLakshmi likes. She has gone elsewhere, and we are left with nothing.’\nRani stood silently for a while, then replied, ‘Never mind, Ramu. We have\nlearnt our lesson. I now think of the days when I would work all day long and\ngo to sleep a tired person and sleep soundly. I would fall into a deep slumber\nas soon as I Iay down on the bed. Now I lie awake all night, wondering which",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "as soon as I Iay down on the bed. Now I lie awake all night, wondering which\nsari to wear the next day and what to do with our money. I am too fat to even\ndig, like I did when I found the treasure!’\nRamu smiled and hugged his wife. ‘We’ll go back to our village, and to our\nold ways. We will work hard like we did once, and we will help everyone\naround us. Maybe that will make Lakshmi come back to us one day. And even\nif she doesn’t, we will try and be happy with what we have.’\nSo Ramu and his family went back to their old home. And do you know\nwhat? They did live happily ever after!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The gods watched what was happening with Ramu and Rani from the heavens\nas Lakshmi entered and then left their house. They had to agree with her—if\nthe people of the house she entered became nasty, then what could she do\nexcept leave, and hope they saw the error of their ways?",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Donkey and the Stick\nAjji was on an outing with her daughter and daughter-in-law, Sumati and\nSubhadra. One lived in Bangalore and the other in Mumbai. They were\nreturning the next day as they had used up all the leaves their offices had\ngiven. The children would remain at Shiggaon though, with their\ngrandparents. Everyone was looking forward to this stage of the holidays. The\nchildren because there would be no parents telling them what to do, to Ajji’s\ndelicious food and to fun outings with Ajja. The grandparents, too, were\nlooking forward to having the children to themselves. The rest of the year it\nwas only the two of them in the house.\nAs Ajji walked with the two younger women, they talked about how\ndifficult it was for them to manage their office work and the children. Ajji\nlistened silently. Then Sumati said, ‘But they are so good when they are with\nyou, Amma. How do you manage them so well?’ Subhadra nodded. ‘I have",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "you, Amma. How do you manage them so well?’ Subhadra nodded. ‘I have\nread so many books and articles to find out about this, but nothing works the\nway it is written in books.’\nNow Ajji said, ‘Do not always go by what you read in books. Learn to use\nyour life’s experiences, read between the lines.’ Then she grinned and said,\n‘Otherwise you will become like the people in the story about the donkey and\nthe stick!’\nSumati and Subhadra forgot they were at the temple and clamoured\ntogether, ‘What is this story? Tell us!’ Ajji shook her head. ‘Now you are\nbehaving like children. But you are my children after all. All right, come join\nus at night when I tell today’s story.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "That night the two mothers were the first to appear to listen to the stories.\nThe children were surprised to see their mums, and Ajji started her story.\nAruna Marg was a busy road. It connected a number of villages to each other\nand many people, animals and carts used it every day. Walking along that\nroad, a group of students discovered a rock which no one had bothered to look\nat in many years. ‘Look!’ they told each other in excitement, ‘there is\nsomething written on the rock. What can it mean?’\nThey called out to their teacher. When they examined the rock carefully,\nthey found the markings were actually little drawings. One showed a stick,\nand the other a donkey.\nBy now a large crowd had gathered. Everyone was puzzled. What could\nthese strange drawings mean, they asked, scratching their heads. They\ndecided to go to the ashram of a wise sage nearby and ask him. But when they\ntrooped into the ashram, they found to their disappointment that the sage had",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "trooped into the ashram, they found to their disappointment that the sage had\ngone on a long pilgrimage. Only his young disciple was there, looking after\nthe cows and calves.\nThey asked the disciple if he could throw some light on the strange\ndrawings. Now this young man was not very bright. But like many foolish\npeople he loved to put on an air of learning and pretend to be very clever. He\nexamined the drawings carefully and minutely. Then he proclaimed, ‘It is\nvery simple. This is the drawing of a magic stick. The man with the stick is\nthe hero of this place. He died protecting this village centuries back. Each\nperson using this road must worship the rock and make an offering to it. The\none who ignores it will become a donkey!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The villagers were astonished to hear this strange explanation. But they\nwere devout people and on that very day they set up a shrine around the rock.\nThey installed the foolish disciple as head priest in charge of taking offerings\nfrom passing travellers. The disciple was pleased with his brainwave. Of\ncourse he did not know what the silly drawings meant, but he no longer had to\nrun after calves and get kicked by angry cows in the ashram! He could sit by\nthe rock the whole day, taking his pick of the offerings to the rock and mutter\na few mumbo-jumbo prayers.\nHis happiness lasted a few months—till the wise old sage returned to the\nashram. The old sage was annoyed to find his disciple missing and his\nbeloved animals roaming around, uncared for. Then he looked into the\ndistance and saw a large crowd gathered by the road. He went to investigate,\nand found his missing disciple there, looking happy and well fed, busy",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and found his missing disciple there, looking happy and well fed, busy\naccepting offerings for a rock. He stood watching for a while. Then he walked\nup to the rock and closely examined the pictures. Without saying a word, he\npicked up a stout iron rod and, to the astonishment of the gathered crowd,\nstarted moving the rock. Many came forward to help him and when they had\nbeen able to move the rock, they found a pot of gold under it!\nThe sage said to the people gathered around him: ‘The pictures meant you\nhad to move the rock with an iron rod and find the hidden money. If you\ndidn’t, you were all like donkeys. You should not follow rituals and the words\nof others blindly. Think for yourselves and understand why you are doing\nwhat you do. If you had given this some thought, you would have recovered\nthis treasure many months ago. Instead, you wasted your time and money\nmaking offerings to a rock and helping this greedy disciple of mine become",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "making offerings to a rock and helping this greedy disciple of mine become\nfat and make fools of you. This treasure belongs to all of us. Let’s use it to\nkeep this road in good repair so everyone can use it and go about their work\nin peace.’\nThe villagers hung their heads in shame for they realized how foolish they\nhad been. As for the disciple, he had to clean the cowsheds for many months\nto atone for his greed.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘What’s in It for Me?’\nAjja told Anand, ‘Will you go fetch my clothes from the dhobi?’ Anand was\nreading a book, and said without looking up, ‘Then what will you give me?’\nAjja smiled and said, ‘I will give you nothing. Why should I give you\nanything? You are a part of the family.’ Anand looked up now. ‘Oh! But that\nis not true in our house,’ he declared. ‘Whenever my dad tells me to do some\nwork, I ask for a reward and he gives it to me.’ Ajja was surprised. ‘Let me\ntalk to your father. The joy of helping someone itself is a reward. This is not\nright.’\n‘Dad is a big officer in a bank. Can he make mistakes?’ asked Krishna with\ngreat surprise.\n‘He may be an officer in the bank but at home he is your father and my son,\nand I will talk to him. If you go on like this you will become like “Mushika”.’\n‘What’s a “Mushika”?’ asked Sharan.\nAjja looked around. There was no sign of Ajji. Probably churning out some\nlast-minute masala powder for the mothers to take back with them. He looked",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "last-minute masala powder for the mothers to take back with them. He looked\npleased. ‘Today I will tell you a story. Of a Mushika and what happens if you\nwant to be paid for every little thing.’\nMushika the mouse walked jauntily down the road, whistling a happy tune to\nhimself. There had been a storm earlier in the day which had got rid of the\nsummer heat. He had just eaten a big, juicy mango that had fallen in the\nstorm, so his tummy was full and he was as pleased as Punch. On the road, he",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "saw a twig, also fallen from the tree above in the storm. Now a mouse will\nstore and keep anything, hoping it will be of use one day. So Mushika picked\nup the twig in his mouth and set off.\nA little ahead he met a potter. The potter was sitting with his head in his\nhands. Why? Because his oven had been drenched in the rain and now he did\nnot have enough dry wood to light it again. How would he bake his pots and\nsell them?\nAs the potter sat wailing in front of his house, Mushika walked up and\nwatched him for some time. ‘Wossh up, brother?’ he asked with the twig still\nclutched in his mouth.\nAt first the potter paid no attention to the strange talking mouse. Then\nwhen Mushika asked him again and again, he told the little creature why he\nwas crying. Mushika nodded, kept the twig aside and said, ‘See, this twig has\ndried in the wind and can be used to light your kiln. I’ll happily give it you,\nBrother Potter, but what’s in it for me?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Brother Potter, but what’s in it for me?’\nThe potter thought hard and, deciding that a little mouse could not ask for\nmuch, said, ‘I will give whatever you ask for.’\nIn a flash Mushika replied, ‘Then give me that large pumpkin that is lying\nin the corner of the room.’\nThe potter was astonished—how can a mouse carry a pumpkin? Besides,\nhe had been looking forward to the lovely pumpkin curry his wife would\nmake for him that night. ‘Choose something else, little mouse,’ he urged. But\nMushika was stubborn—the pumpkin for the twig or nothing.\nSo the potter gave Mushika the pumpkin. The mouse was delighted. He had\nmade a mighty human do what he wanted! He left the pumpkin near the\npotter’s house saying he would collect it soon and set off down the road\nagain.\nFurther ahead, a milkman was sitting by his cows, shaking his head.\n‘What’s up, Brother Milkman?’ asked a tiny voice. To his astonishment the\nman saw a mouse with bright eyes peeping up at him.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "man saw a mouse with bright eyes peeping up at him.\nSadly he shook his head some more, then said, ‘The storm scared my cows\nand they are refusing to give me milk. What will I sell today and what will my\nfamily eat?’\n‘Spicy pumpkin curry—if you want!’\n‘Surely you are joking, my friend. I have ten people at home. Where will I\nget a pumpkin large enough to feed everyone?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Just walk back the way I came. You will reach a potter’s house. Right\nbeside that I have left a pumpkin. That’s mine, and you can have it. But\nwhat’s in it for me, Brother?’\nThe milkman shrugged and said, ‘Whatever you want.’ Like the potter he\nthought, what can a mouse want?\nMushika said, ‘Then give me a cow.’\n‘Are you mad? A pumpkin for a cow? Whoever has heard such a thing?’\n‘It’s that or nothing, my friend,’ replied Mushika firmly. So the milkman\nwent and got the large pumpkin and gave one cow to the mouse.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "A big cow with large horns that listened to what he commanded! Mushika\nthe mouse could not believe his luck. Off he went, seated on the cow,\nwhistling another happy tune, when he stopped in front of a marriage hall.\nWhy were people standing around looking sad and worried? They should be\nbusy preparing for the marriage feast! Even the bride and groom were\nstanding, with long faces.\n‘What’s up, Brother Groom?’ called Mushika, sitting atop his cow.\nThe groom replied gloomily, ‘There’s no milk to prepare the wedding\nkheer. How will the wedding feast be complete without the dessert?’\nMushika grinned. ‘Worry not. Here, take this cow, she is now happy and\nwill give you milk. But what’s in it for me, Brother?’\nThe groom was very happy and said, ‘Why, you can have whatever you\nwant! You can eat your fill of the feast—sweets, pulao, fruits, whatever your\nheart desires.’ The mouse kept quiet and gave the cow to the wedding party.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "heart desires.’ The mouse kept quiet and gave the cow to the wedding party.\nThey milked the cow and had plenty of milk. There was a great wedding\nfeast. After the party was over, the mouse replied in a flash, ‘Give me your\nbride!’\nThe groom and everyone in the marriage party were astonished at the\nmouse’s cheek. The groom was about to give him a good whack, when his\nnewly wedded bride stopped him. ‘You had given him your word that he\ncould have whatever he wants. Let me go with him. I’ll teach him such a\nlesson that he will never try to carry off another human bride again!’\nHer husband agreed, so off she went with the mouse.\nMushika scampered ahead, eager to show the bride his home. But what was\nthis, why was she walking so slowly?\n‘Hurry up, Bride,’ he called. ‘It’s about to rain again.’\nThe bride replied, ‘I am a human, I can’t run as fast as you.’\nSo Mushika had to slow down. By the time they reached his home, which\nwas a little hole under a tree, he was very hungry.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "was a little hole under a tree, he was very hungry.\n‘Cook me a nice meal with lots of grain,’ he commanded.\nThe bride nodded and said, ‘Of course, but where is the kitchen, the spices,\nthe oil and the vessels? I am a human after all. I can’t cook only grains.’\nThe mouse realized he was in a real fix having got this useless human back\nwith him. ‘Never mind,’ he sighed. ‘At least come inside the house.’\n‘Oh, but how will I do that?’ wailed the bride. ‘I cannot set even a toe\ninside that hole, it is so small. Where will I sleep tonight?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Err, how about under that tree?’ Mushika suggested, pointing to another\nbig tree nearby.\n‘No way,’ sniffed the bride. ‘It will rain and I will get wet and I will catch a\ncold, then a fever, and I will need a doctor, who will give me bitter medicines\n. . .’ Now she started wailing even louder.\n‘Shush shush,’ Mushika comforted her, thinking he should have agreed to\neat his fill of the wedding feast instead of bringing this strange whiny woman\nback home with him. ‘How about you stay in that temple veranda for the\nnight?’ he suggested, pointing to a big temple across the road.\n‘Oh, but thieves and robbers will come there, and try to snatch away my\nlovely jewels,’ cried the woman. Then suddenly she dried her tears and said,\n‘What if I call my friends Ram and Shyam to protect me?’\nBefore Mushika could say anything, she whistled loudly and called, ‘Ramu,\nShyamu!’\nFrom nowhere a big dog and cat appeared next to her and made as if to eat",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Shyamu!’\nFrom nowhere a big dog and cat appeared next to her and made as if to eat\nup Mushika. Oh, how he ran and saved his life by jumping into the safety of\nhis hole.\nThe bride grinned and went back to her wedding feast with her faithful\npets. As for Mushika, he had to go to sleep on an empty stomach that night.\n‘Tomorrow,’ he sighed, ‘perhaps there will be another storm,’ and went off to\nsleep.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Princess’s New Clothes\nAfter their mothers went back, Ajji took all the children on a shopping spree.\nThey went to the biggest clothes store in the town. Ajji had filled her purse\nwith notes and told all the seven children, ‘Each of you can buy one dress. It\nis our gift to you. Remember, I have Rs 500 for each of you to buy one dress.’\nAt the store she chose a nice comfortable chair. The children were allowed\nto decide which clothes they wanted and in which colour. They could go into\nthe trial room and try them out before buying. After an hour, everybody had\nwhatever they wanted, except Krishna. She had tried on many many dresses\nbut found fault with all of them. She told Ajii, ‘This store does not have\nanything nice for me. Shall we go to another one?’\n‘What is wrong with this one? It is a well-known store,’ Ajji remarked. But\nKrishna pouted and complained that she already had the colours and cuts\navailable here, so everyone trooped off to the next shop. There, too, after a lot",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "available here, so everyone trooped off to the next shop. There, too, after a lot\nof thought, finally, Krishna chose her dress. Ajji had been watching all this\nwith her typical soft smile. On the way back, as they piled into the taxi, she\nwhispered to Krishna, ‘It’s good you chose a dress finally. But beware, or else\nyou may turn out to be like that princess . . .’\n‘Which princess, Ajji?’ the children asked.\n‘The one in the story.’ Ajji was now looking out of the window.\n‘Tell us, oh tell us!’\nSo Ajji told them the story of the princess who never liked any of her\nclothes.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The king and queen of Ullas were very sad. No one was attacking them, the\nsubjects were happy, the farmers had grown a bumper crop . . . then why were\nthey so sad? Because they longed for a child and did not have one.\nOne day, they learnt of a place in the forests in the kingdom, where if you\nprayed hard and well, you were granted your wish. They went there and for\nmany days prayed to the goddess of the forest. Finally their prayers were\nheard and the goddess appeared before them and asked what they wished for.\nThe king and queen bowed low and said, ‘We wish to have a child.’\n‘So be it, you will soon have a little girl,’ said the goddess, shimmering in\nthe greenery. ‘But remember, though she will be a loving child, she will have\none flaw. She will love new clothes too much and it will make life difficult for\nyou. Do you still want such a child?’\nThe king and queen wanted a baby so much they would have agreed to\nanything. So the goddess granted them their wish and vanished back among",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "anything. So the goddess granted them their wish and vanished back among\nthe trees.\nSoon, as had been said, the queen gave birth to a lovely baby girl. Oh, what\na beauty the little thing was, with her jet-black hair and thick eyelashes and\nlong toes and fingers. They named her Beena. The kingdom rejoiced in their\nking’s happiness and for a while there was complete joy everywhere.\nBeena grew up a child loved by everyone. She became prettier by the day,\nand with her charming manners and ready laughter, she filled everyone’s\nhearts with joy. But, as the goddess had said, she did have one flaw—she\nloved new clothes! She loved clothes so much she had to have a new outfit\nevery day. She would refuse to wear the same clothes twice! Tailors from all\nover the kingdom and even outside created beautiful, extraordinary clothes for\nher. Silk, cotton, wool, you name it, and Beena had a dress or sari of that\nmaterial. Blues, greens, reds, pinks, every colour in nature was present in her\nwardrobe.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "material. Blues, greens, reds, pinks, every colour in nature was present in her\nwardrobe.\nFor a while the king and queen were happy to let her have new clothes\nevery day. But soon they realized they were spending all their money and\ntime in finding new tailors and clothes for their daughter! This had to stop.\nThey coaxed and cajoled and pleaded and scolded, but Beena remained\nunmoved. Her parents understood this was the flaw the goddess had warned\nthem about, and finally decided to send Beena to the goddess to find a\nsolution.\nBeena entered the dark, green forest and waited for the goddess to appear.\nShe came in a flash of green light, which lit up everything around her. Folding",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "her hands, Beena told the goddess why she had come.\n‘I know your problem, my child. I will send you a new outfit every day. It\nwill be unique, its colours and design will delight you. But you should\nremember one thing: you cannot wear anything else, or exchange these\nclothes with anyone else. If you ever do that, your life will be miserable.’\nHappily Beena agreed to this. After all, why would she be unhappy if she\ngot a new dress every day?\nFrom then on, Beena woke up each morning to find an extraordinary new\nsari or dress lying by her bed, ready to be worn. It was a dream come true for\nher! She enjoyed herself no end, choosing matching earrings and bangles and\nshoes, and everyone kept telling her how pretty she looked.\nYet after some months the excitement died down. No one remarked when\nBeena sashayed in wearing another fantastic dress. ‘Oh, it’s the goddess’s\ngift,’ they all said. ‘It’s not something you or I can ever have,’ all her friends\nsaid and shrugged and went their way.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "said and shrugged and went their way.\nBeena grew sad. Then one festival day, while walking near the river, she\nnoticed a girl wearing a simple cotton sari. There was something about the\nway the girl walked and how attractive she looked which made everyone turn\nand stare. Beena noticed how the people were admiring the girl. She became\njealous because no one noticed her beautiful clothes any longer, yet they had\nsuch praise for this simply dressed girl. She forgot all about the goddess’s\nwarning and went up to the girl and said, ‘Will you take my dress and give me\nyour sari in return? It is so lovely that people can’t take their eyes off it.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The girl was astonished. The famous Princess Beena was offering to take\nher sari, and was giving her a marvellous outfit in exchange! She could not\nbelieve her luck and happily gave her sari to Beena. She then wore Beena’s\ndress and went away. No sooner had Beena worn the girl’s sari than there was\na flash and a bang. Her surroundings changed, and she found herself\ntransported deep inside the forest, in front of the goddess.\n‘Beena,’ the goddess called. ‘I had told you that you cannot give away or\nexchange the clothes I gave you. But you have done just that! I am afraid\nthere is a punishment for not listening to me. I will have to take you away\nfrom the world of humans forever.’\nBeena looked down in sadness. She thought of her parents’ tear-stained\nfaces, the grief of the people in her kingdom who had loved her dearly. Then\nshe spoke aloud, ‘I will go away, but do grant me one last wish. Turn me into\nsomething that will remind everyone about their beloved princess, something",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "something that will remind everyone about their beloved princess, something\nthey may even find useful.’\nThe goddess smiled and turned Beena into a plant. Do you know what plant\nBeena became? An onion! Have you noticed how the onion has so many\nlayers? Those are all the dresses that Beena once wore. And have you noticed\nyour mother’s eyes water while she cuts onions? That is because unknown to\nourselves, like all the people in Beena’s kingdom, we still shed tears the\nbeautiful, kind-hearted princess!\nAfter listening to this story, Krishna wailed, ‘Ajji, I don’t want to be like\nBeena. I don’t want to get turned into an onion! I promise not to fuss over my\nclothes from now on!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Story of Paan\nVishnu Kaka had invited the entire family for dinner. It was a lavish meal\nwith many courses. Everyone ate their fill, enjoying each dish. After it was\nover, the children gathered around Kaka as he brought out his big box of\npaan. They loved watching Kaka choose and mix his ingredients to make\ndelicious paans which the grown-ups then ate with blissful looks on their\nfaces.\nHe explained to the children, ‘A paan contains betel leaf, betel nut and\nlime. But we should use only so much of each ingredient. Only then will it\ntaste good.’ All seven children wanted to try this experiment on their own.\nSome of them chewed on only the leaf, some on the nut, and others on the nut\nand leaf, or the leaf and only lime. It was true, when the three were not put\ntogether, the paan tasted horrible! In fact, Sharan vomited when he added\nmore lime than necessary! Everyone made a beeline for the mirror to check if\ntheir tongues were red or not.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "their tongues were red or not.\nAjji was sitting and chatting with Sharan’s mom and watching their antics.\nThen she called out to them and said, ‘Children, by this time you must all\nknow that the leaf, nut or lime on their own taste very bad. Even if you put\njust two together it is no good. Only when you add the three in a perfect\ncombination can a paan be eaten. And that’s when you get that red colour in\nthe mouth!’\n‘Why is that, Ajji? Is there any special meaning?’\n‘Yes there is a special meaning and I’ll tell you the story, which I first heard\nfrom my grandmother.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Once upon a time, there were two brothers, Bhanu and Veer. Their parents\ndied when they were young and Bhanu brought up his younger brother with a\nlot of love and care. When Bhanu was old enough, he married Bharati. She\nwas a gentle, loving person and looked after Veer with as much love as her\nhusband.\nWhen Veer was about twenty years of age, he heard that their king was\nlooking for soldiers to join his army, as there was going to be a war. Veer\ndecided to join the army. Oh, how much his brother and sister-in-law cried\nand pleaded, telling him to remain at home with them. They could not bear\nthe thought of the boy they had brought up with so much affection going so\nfar away from them. But Veer insisted on becoming a soldier, so they let him\ngo away, with a heavy heart and tears in their eyes.\nFor many days there was no news of Veer. The king went to war,\nvanquished his enemy and returned. The soldiers who went with him also",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "vanquished his enemy and returned. The soldiers who went with him also\ncame back home. But of Veer there was no sign. Day after day his brother and\nsister-in-law watched out for him, hoping to see him come walking down the\nroad, back home. But there was no one. Then, one day, a group of soldiers\npassed through their village, returning home from the war. Bhanu called out\nto them and asked about his brother.\n‘Veeru, oh yes, so sad, he died, you know, in the battlefield,’ said one,\nshaking his head.\n‘No no. He was injured, and he recovered. Did he not come home?’ said\nanother.\n‘He was on his way home when he fell ill,’ informed a third.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "On hearing these awful tidings, Bhanu was deeply saddened. He decided he\ncould not live at home waiting for his dear little brother to return. He would\ngo and look for him. When he told his wife, Bharati too decided to go with\nhim. Together, they set off one day to look for the missing Veer and bring him\nhome.\nThey decided to go to the site of the king’s big battle, where Veer was last\nseen by his companions. This place was far away and they had to travel\nthrough forests and valleys and mountains and deserts. The two walked and\nwalked, over many miles, but poor Bharati was not strong enough. One day,\nafter travelling through a thick forest, they reached a little hamlet. Bharati sat\ndown, exhausted. Then to Bhanu’s great horror she died out of sheer\nexhaustion. Unable to bear his grief, Bhanu too died immediately.\nOver many years at the place where the couple had died, two trees grew.\nOne was a tall tree and the other a creeper that hugged the tree. It was as if",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "One was a tall tree and the other a creeper that hugged the tree. It was as if\nBharati and Bhanu were together even in death.\nMeanwhile, Veer, the brother they had loved so deeply, was not really dead.\nHe had got terribly wounded in the war and spent many years recovering from\nhis injuries in a little village far away from home. When he finally recovered,\nhe came back as fast as he could to his old house, knowing how anxious his\nfamily would be for him.\nBut imagine his surprise when he found the house locked and bolted,\nabandoned for many years. Slowly the neighbours gathered around and told\nhim how Bhanu had decided to go looking for his lost brother.\nThat night Veer cried many bitter tears. How would he find his beloved\nbrother and sister-in-law now? Where were they? By the time morning\ndawned he had made up his mind. He would try and go the way they had\ntravelled and find them. Immediately he set off.\nVeer was a soldier, but he had only lately recovered from many wounds and",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Veer was a soldier, but he had only lately recovered from many wounds and\nwas not too strong. It took him many days to walk across the difficult land\nBhanu and his wife had crossed. Then one day, near a forest, he came across a\nlittle shrine. The villagers told him the sad story of how the shrine came to be.\nYears ago a couple had arrived at the spot, tired from days of walking. Legend\nhad it that they were on the way looking for a long-lost brother. When the two\ndied without fulfilling this wish, two wonderful plants, unknown to anyone\nearlier, had grown at the spot. The leaves and nuts from the trees were so\nsweet and refreshing that the villagers decided to build a small temple for the\nman and the woman at the place.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Veer listened to the story with growing sorrow. He realized the couple they\ntalked about was none other than his brother and his wife. Unable to bear the\nnews, he turned into a statue of limestone.\nDo you know how they have all been remembered ever since? The tall tree\ngrew nuts called areca nuts, the creeper’s leaves were paan or betel leaves and\nfrom the statue came the lime paste that is added to preparations of paan. And\nthis is how this loving family came together even after death. Together they\ntaught people the values of love, unity and loyalty, and when people chew\npaan they remember this story.\nSharan’s mom was surprised to hear this story. ‘Really, Ajji,’ she said, ‘even I\nwas not aware why these three ingredients are always used to make a paan. I\ntoo will come to listen to your stories from now on!’\nAjji nodded, then she added with that glint in her eyes, ‘Chewing paan is\nnot good for your teeth. Everyone, off you go to brush your teeth!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Payasam for a Bear\nAjja and Vishnu Kaka were planning something! They could be spotted\ngrinning and nodding and whispering. The children were dying to know what\nit was. Then one evening, they finally broke the news. They were all going on\na picnic! It would be a picnic at the nearby falls. These waterfalls were really\nbeautiful, with the river meandering close by and the forest just across. The\nchildren got even more excited when the two grandpas revealed the rest of the\nplan. Tomorrow would be a rest day for Ajji and Sharan’s mother, because all\nthe cooking would be done by them and the children! And they would do it\nthe traditional way, by gathering firewood and then cooking the meal from\nscratch.\nThe children were so excited they could hardly sleep that night. All they\ncould talk about was the picnic and what they would cook. Before nodding\noff they had decided the menu—pulao and kheer! Payasam or kheer is so easy\nto make, and who doesn’t love it?",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "to make, and who doesn’t love it?\nThe next day, even the usual late risers were up and about and ready to set\nout for the picnic by seven o’clock. Oh, what a beautiful spot it was! They all\nran around exclaiming over everything and getting ready with their cricket\nbats and balls for a game. Ajji sat comfortably under a big tree. Then it was\ntime to get lunch ready. Everyone started looking for twigs to use as firewood.\nAjji spotted Divya straying towards the dense thicket of trees and called out,\n‘Divya, come back, don’t go there. Who knows what animal is there, and on\ntop of that you all are going to cook payasam . . .’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Minu’s ears pricked up immediately. ‘Why, Ajji, what does payasam have\nto do with animals?’\nAjji grinned, ‘But bears love payasam! Don’t you know?’\nEveryone declared they had never known this piece of information. So\ncooking and games forgotten, young and old gathered around her to hear the\nstory of a bear who wanted to eat payasam.\nDid you know that you must never ever anger a bear? It is true; an angry bear\ncan do some really awful things, so it is always safer to keep your word to\nhim. Poor Mohan and Basanti did not know this, and tried to trick a bear, and\nsee what happened to them!\nMohan had a banana plantation, where he grew delicious bananas. He also\nhad a huge mango tree that provided him with baskets of juicy mangoes every\nsummer. He would sell these fruits in the market and lived happily enough\nwith his wife, Basanti.\nOnce, his trees yielded an exceptionally large crop of bananas and\nmangoes, and he decided to sell them in the market in the city, where he",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "mangoes, and he decided to sell them in the market in the city, where he\nwould get a higher price for them. So off he went with his sacks and baskets\nto the city. There he sat in the market, sold everything that he had brought,\nand made quite a bit of money. At the market, he ran into an old friend, Amar.\nMohan and Amar were overjoyed to see each other after many years.\n‘Come to my house, dear friend,’ insisted Amar. ‘Let us enjoy a good meal\nand talk about our childhood days.’\nMohan thought this was a wonderful idea, and went with Amar to his\nhouse. There the two friends ate huge quantities of rice, dal, lovely vegetables\nand all kinds of sweets. Then, finally, out came the best part of the meal—the\npayasam!\nPayasam is known by many names all over India. Some call it kheer, some\npayesh, and others, payasam. It is made with milk, rice and jaggery and many\nother ingredients, and it is always yummy! So was the payasam that Amar",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "other ingredients, and it is always yummy! So was the payasam that Amar\nserved his friend. It was made with fragrant rice, creamy milk, sweet-as-sugar\njaggery, and strewn with nuts, cardamoms, saffron and all kinds of wonderful,\nmouth-watering things. Mohan ate and ate bowl after bowl of this dessert, till\nhe was ready to burst.\nThen the two friends chatted and rested, till it was time for Mohan to head\nback home. When he reached his house, he told his wife about the",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "scrumptious meal, particularly the payasam he had eaten. Oh, how Basanti\nsighed and longed to have tasted this dish too! Seeing her face Mohan\nsuggested, ‘See, I have earned plenty of money by selling the fruits. Why\ndon’t I buy the things required to make payasam, which you can cook and\nboth of us will enjoy it together?’\nBasanti thought this was a wonderful idea. But first Mohan needed to go to\nthe forest to collect some firewood. Then he could go to the shop and get all\nthat was required to make the dessert. So off Mohan went, swinging his axe\nand whistling a tune. Now who would be sitting dozing under a tree in the\nforest but a big black bear. He had just had some nice berries for lunch and\nwas enjoying his snooze, when Mohan walked by. First the bear opened one\neye, then another, and watched as Mohan cut a few branches of a nearby tree\nand collected twigs for firewood. Just as Mohan was tying it all up in a neat\nbundle, the bear spoke up.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "bundle, the bear spoke up.\n‘Hi there, friend. Where are you off to in such a happy mood, and why are\nyou collecting so much firewood? Tell me, are you cooking a feast tonight?’\nMohan was astonished and a little scared to be addressed like this by a bear.\n‘Y-yes, your honour, I mean, dear bear, ss-sir,’ he mumbled and stammered.\nThe bear was happy after his meal, so he decided to chat some more with\nMohan.\n‘So tell me, what are you going to cook tonight?’ he asked, patting his\ntummy.\n‘P-p-payasam,’ answered Mohan.\n‘Paya . . . what?’ The bear was puzzled.\n‘Pa-ya-sam,’ Mohan said slowly. ‘It’s a sweet dish.’\n‘Tell me more!’ The bear was intrigued.\nSo Mohan described payasam and how it was made. As he talked about\nmilk and rice and nuts and jaggery, the bear’s eyes started gleaming, his\nstomach started rumbling, and he realized he absolutely, totally needed to\ntaste this wonderful human food.\n‘Oh Mohan, my friend, do let me come and share your payasam tonight,’\nthe bear begged.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Oh Mohan, my friend, do let me come and share your payasam tonight,’\nthe bear begged.\nMohan was astonished. A bear as a guest for dinner! Who knows how\nmuch he would eat! But neither could he say no—that seemed so rude, and\nthe bear was looking at him hopefully.\nHe sighed and replied, ‘All right. You can come. But to cook so much\npayasam I will need much more firewood. Can you bring that with you?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Cunning Mohan thought he would make the bear do his work for him, so\nhe would not need to come to the forest for the next few days.\n‘Yes, yes!’ The bear jumped up. ‘Just tell me how much firewood you need.\nTen? Twenty? Thirty bundles?’\n‘Umm, fifty would be enough,’ decided Mohan. Then he slung his bundle\nof firewood over his shoulder and went back home. On the way he bought lots\nof milk, rice and everything else they would need to make the payasam.\nWhen he reached home he told Basanti about the unusual guest who would\ncome to share their dessert. So Basanti cooked a huge quantity of payasam.\nShe added lovely nuts, aromatic saffron, sweet cardamoms and many\nwonderful things into it as she cooked. Oh, how marvellous the payasam\nsmelt. Unable to wait any longer, the two started eating helping after helping\nof the dish, without waiting for their guest to turn up. They ate and ate and\nate, till they realized they had eaten up everything! There was not a grain of",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "ate, till they realized they had eaten up everything! There was not a grain of\nrice, nor half a nut left for him!\nThey sat around wondering what to do. What would they say to the bear\nwhen he came expecting to eat payasam? Then, a devious plan entered\nMohan’s head. What if they made payasam with all kinds of other\ningredients? After all, it was only a bear, and he had never tasted this dish\nearlier, so how would he know what it really tasted like?\nThe cunning man and his wife then took a little bit of milk, added lots of\nwater to it, threw in a handful of rice, and instead of jaggery and nuts and\nspices they added pebbles and sand and cardamom husks and stirred and\nstirred the mixture till it looked somewhat like payasam. They placed the\nbrass pot filled with this in front of the house and went and hid in the bushes\nsomewhere at the back.\nAs soon as night fell, a huge dark figure appeared down the road. On its\nback it carried fifty bundles of firewood. It was the bear, come to dinner!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "back it carried fifty bundles of firewood. It was the bear, come to dinner!\nHe reached Mohan’s house and looked around. There was no one. Then,\nright in front of the house, he spotted the pot full of payasam. Unable to wait\nany longer, he flung down the bundles he had carried and fell upon the\npayasam. Only after he had eaten more than half the potful did he realize\nsomething was wrong. The milk was watery, the rice was half cooked and\nthere was horrible grit and pebbles between his teeth! Ugh!\nOh, how angry he was now! Furious, he shouted out for Mohan. But\nMohan was cowering behind the bushes and did not reply. Now angrier than\never, the bear spotted the mango tree and rubbed his back against it. The",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "mangoes came raining down, he shook the tree so hard. The bear continued to\nstamp and shake the tree, till it fell with a huge crash right on to the banana\nfield and crushed the best banana plants. Seeing the firewood he had carried\nall the way from the forest lying around, the bear started throwing them\naround. One fell into the oven in the kitchen and set fire to the house. Soon\nMohan and Basanti’s house was in flames, his field in ruins and his prized\nmango tree destroyed.\nFinally satisfied that he had taken his revenge the bear stormed back into\nthe forest. When Mohan and his wife crawled out of their hiding place and\ncame back home they saw everything was in ruins. How they wailed and wept\nand wished they hadn’t been so greedy and left the bear his share of payasam.\n\n\nBut what was the use of lamenting now? The damage was done, and the\ngreedy couple had learnt what I told you earlier—never anger a bear! And if\nyou make a promise to one, keep it!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Fire on the Beard\nWhat a grand picnic everyone had! They played and ate and splashed in the\nwater till late evening. Ajja and Ajji had to drag them back home. That night\nthe children tumbled into bed and were fast asleep even before Ajji switched\noff the lights. Quietly she tucked them in. The next morning there was no sign\nof anyone waking up. Ajja and Ajji went about their work, not waking the\nchildren. But when it was ten o’clock, Ajji decided they had to wake up now.\nSo she came into the room and found all four were up and chatting in bed.\nShe looked at them for a while with her hands on the hips. Then she said, ‘So,\nI think you’ve had enough rest. Now up all of you. Wash up and get ready. I’ll\ngive you your lunch by noon.’\nAll the others jumped up except Anand. He grinned at Ajji and said, ‘You\nknow, I can live without food if I get to lie in bed all day.’\n‘Really?’ Ajji said. ‘So be it. Everyone else, lunch will be ready at twelve,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Really?’ Ajji said. ‘So be it. Everyone else, lunch will be ready at twelve,\nso be there on time. Oh, and those who lie around in bed will also miss the\nafternoon story.’ Then she walked off trying to hide a smile. Anand and miss a\nmeal! He was the one who loved his food the most!\nAnand was quiet. The rest sprang out of their beds and went to brush their\nteeth and have a bath. Soon the aroma of onion dosa wafted through the\nhouse. It was too delicious to resist. Everyone gathered in the kitchen to help\ngrind the dosa batter.\nBy now Anand was bored and hungry, lying alone in bed. He quietly went\nand took his bath. He was worried—what if Ajji had taken him seriously and\nnot kept a share of the dosa for him? And what if he had to miss that day’s",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "story? When Ajji saw him appear at the kitchen and join in, she laughed and\nsaid, ‘You have become like Brij.’\n‘Who is Brij, Ajji?’\nSo Ajji started the story while the children ate the dosas.\nYaaawwnnn! Brij stretched out in the sun, yawned loud and long, and went\nback to sleep. Is Brij a rich man on a holiday; or has he worked hard all day\nand just resting for a while? Neither! Brij was the laziest, most good-for-\nnothing fellow you’ll ever meet. He would spend entire days just lying around\non his bed doing nothing. He was too lazy to even trim his beard and it had\ngrown right down to his knees. All day he sat around combing it and admiring\nit, doing nothing else. His mother would call him, his wife would scold him,\nbut Brij was not one to mend his ways.\nThis is how most conversations with his wife, Shanti, would go:\n‘Can you get some water from the well? There is no water in the house.’\n‘The well is dry. There’s no water there.’\n‘Can you fetch water from the pond, at least?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘The well is dry. There’s no water there.’\n‘Can you fetch water from the pond, at least?’\n‘The pond is too far. I can’t walk so much for a pot of water.’\n‘Then pluck those coconuts from the tree.’\n‘Oh, those coconuts are still tender. Let’s pluck them next month.’\n‘What about getting some areca nuts from the tree then?’\n‘Don’t you know, areca nuts are not good for health?’\n‘Help me plough the field then.’\n‘It is too hot. The sun will burn my skin. It’s better if you too did not go\nthere.’\n‘Can you at least look after the house when I am in the field?’\n‘There is nothing to look after in the house.’\nAnd so on and on Brij would make excuses for not doing any work that\nwas asked of him. Of course he was never too tired to eat! As soon as his wife\nwould lay out the meal, he would jump out of bed saying, ‘Oh you have\nprepared food for me with such love, it is my duty to eat it.’ And then he\nwould gobble down all that was given.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "would gobble down all that was given.\nWhen evening fell, Brij would roll out of bed, comb his hair and beard and\nset off to meet his gang of friends. Seeing how he managed to get out of doing\nany work, many others in the village had decided to do the same. All these\npeople had formed a club, The Idlers’ Club. They would meet every evening",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and sit around and talk about all kinds of things. They claimed this way they\nwere improving their general knowledge, but all they were really doing was\ngossip and boast.\nBrij, as the leader of the club, would get to boast the loudest and longest.\nOne day, the topic was who was the laziest of all.\n‘Bathing every day is such a waste of time and precious water. I take a bath\nonce in two days. That way I even save water!’ said Manoj, the\nenvironmentalist.\n‘I never make my bed,’ boasted Suresh, the innkeeper. ‘Why bother when\nyou have to lie down in it once again at the end of the day?’\n‘I eat my food out of the vessel in which it is cooked,’ claimed Raju, the\ncook. ‘Putting the food in the plate only increases the work for you will need\nto wash it too.’\nNow Brij thought he should say something that would beat all these other\ntall tales. So he said, ‘I am always cool and calm. Why, even if my beard were\nto catch fire I would start digging a well at that time, and never store water",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "to catch fire I would start digging a well at that time, and never store water\nclose at hand!’\nAs these discussions were happening, a real fire broke out in the village! It\nburned down buildings and roofs and sheds, crackling and throwing up\nsparks, making villagers run helter-skelter looking for water to douse the\nflames.\nThe Idlers’ Club heard all the commotion but no one bothered to step out to\nsee what was happening. ‘What is going on?’ they only asked each other.\n‘Oh nothing,’ Brij dismissed the topic. ‘Must be some circus or the other.\nSo, what were we talking about?’\nBy now the fire had spread to their road. It was fast making its way to the\nhouse where the idlers were sitting. It got hotter and hotter. Brij’s friends\nstarted sweating and getting nervous now. Soon the roof of the house caught\nfire. Still Brij kept saying, ‘Don’t worry, don’t worry. It will rain now and put\nthis out.’ Then ‘The wind is blowing in the opposite direction and will blow it",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "this out.’ Then ‘The wind is blowing in the opposite direction and will blow it\ndown. We are really cool people, we should not be afraid of a fire!’\nFinally his friends could stand it no longer and rushed screaming out of the\nhouse. But Brij was too stubborn, and refused to move. Finally the fire caught\nup with him and his beard started getting singed. Now even Brij was scared.\n‘Heellp!’ he shouted.\n‘Now you can start digging the well,’ his friends suggested.\n‘Oh, get me some water from the pond,’ Brij begged.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘That’s too far away,’ the others shouted from outside. ‘Maybe it will rain,’\nthey added.\nBy now the beard was burning away merrily, and all Brij could do was leap\nand dance away from the flames. Till suddenly there were splashes and\nsplashes of water! Someone was emptying cool, cool water on the fire and\nputting it out!\n\n\nBrij could not believe his luck. Who had saved him? Why, it was Shanti\nand many other women of the village who had worked hard and drawn water\nfrom wells and ponds to save their homes.\nFinally Brij learnt his lesson. Being lazy and pretending to be cool had\ncertainly not helped him in his hour of need. So he shaved off his half-burnt\nbeard, woke up early each morning and did all that Shanti told him to do, and\nmore!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Way You Look at It\nOn a sleepy afternoon, while the sun continued to shine, the clouds opened up\nand it started to rain. Sharan had fallen asleep after eating at least fifteen\npooris for lunch. When he woke up, he saw a rainbow in the sky. There was a\nmild drizzle and the bright sunshine of summer. In the sky was a bold, bright,\nclear rainbow. Sharan ran to Ajji’s house and started calling out to his friends.\nSuma and Krishna were playing in the garden. Raghu and Divya were\nreading. Anand was sleeping. Sharan was so excited he called out to each one,\n‘Ajja, Ajji, Suma, Krishna, Raghu, Anand, Divya, come and see this!’\nEveryone rushed out to see what was up. The children gazed in amazement at\nthe rainbow. Living in the city, none of them ever got to see such a vast\nexpanse of the sky, unhindered by tall buildings. Ajja and Ajji were used to it\nand went back to their work.\nThat evening, while having their milk, the children were talking about",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and went back to their work.\nThat evening, while having their milk, the children were talking about\nrainbows. ‘The colours of the rainbow are known as VIBGYOR,’ said Raghu.\n‘A rainbow is called Indra Dhanush in Sanskrit,’ said Suma.\n‘It is known as Kamanabillu in Kannada—the bow of Lord Kamadeva,’\nsaid Sharan’s mother.\n‘In the olden days if the sun and rain came together, we used to say it is the\nfox’s wedding and all of us have to go on the rainbow to reach the wedding,’\nsaid Ajji.\n‘Ultimately it is the same thing, seven colours that appear in the sky when\nthe sun’s rays are reflected by the rainwater,’ said Ajja. ‘It depends upon the\nway you look at it.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Ajji nodded. ‘The same thing appears different, depending on the way you\nlook at it, and today I can tell you a story about that.’ Immediately everyone\nturned their attention from the sky to Ajji.\nDuring one monsoon season, it rained and rained in Chitpur, a little village by\na mighty river. It rained so hard that the river swelled up. Huge waves lashed\nagainst the riverbanks and carried away trees, houses and big chunks of earth.\nThe villagers were really scared and prayed hard for the rains to stop.\nWhen finally the skies cleared, one by one people emerged from their\nhomes. One of them was Raju. He walked down to the riverside. There he\nsaw something that made him rub his eyes in disbelief. Why, a huge black\nrock had appeared there out of nowhere! And what was more, the rock looked\nexactly like the head of Ganesha, the god with the elephant head. Raju\nimmediately prostrated himself in front of the rock. ‘Ganesha not only heard",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "immediately prostrated himself in front of the rock. ‘Ganesha not only heard\nour prayers and made the rains go away, he has come himself to protect us!’\nRaju shouted to no one in particular. ‘I must tell everyone about this!’ he\nyelled and ran back to the village to shape the news.\nNext came Chetan, the sculptor. He had spent so many days cooped up in\nhis house waiting for the rains to stop. Now he was glad to be out in the open,\nand was thinking of his next piece of work. Suddenly he caught sight of the\nnew rock by the river. It was just the right colour, worn smooth with age and\nriver water. It was perfect for the scene he wanted to carve! Giving a whoop\nof joy, he ran home to gather his carving tools.\nJust as he turned the corner, a merchant came by on his horse. The animal\nwas thirsty and he stopped there for it to have a drink of water from the river.\nHe too spotted the stone. ‘What a big stone!’ he remarked. ‘And it is nice and",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "He too spotted the stone. ‘What a big stone!’ he remarked. ‘And it is nice and\nsmooth and flat. Let me sit for a while on it and rest.’ After enjoying a nice\nrest on the rock, the merchant decided he would tell his friends about it. They\nwere travelling together and all of them would be thrilled to be able to sit\nthere for some time, by the river.\nHe went off to find his friends.\nJust then, Ajit, a soldier, came on his horse. He got down and washed his\nface. While his horse was drinking water, he was looking around and the\nsame stone caught his attention. He was surprised and said to himself, ‘What\na huge stone on the riverbed! Maybe I should get it removed so that in an\nemergency it should not become a hindrance on the road. Our army can",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "march better if such obstacles are not there. I must inform my commander.’\nThinking so, he rushed back to his camp to talk to his commander.\nLater in the day Bholu, the village washerman, appeared by the river with\nhis big bundle of clothes. To his astonishment, he found a crowd right around\nhis favourite washing spot. They were all arguing over a rock! Pushing his\nway into the crowd, Bholu spoke in a loud voice, ‘Hey! What do you think\nyou all are doing?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Raju now burst out, ‘This rock is a sign from Lord Ganesha, I want to\nworship it.’\nChetan raised his voice even louder and said, ‘No no, this rock is going to\nbe used for my next sculpture.’\nThe merchant shouted, ‘I have invited all my friends to rest on it! It is\nours!’\nAjit was giving orders to his soldiers to remove the stone.\nBholu now grinned and said, ‘But this rock has been here for years and\nyears! Earlier half of it was submerged in the mud. Now with the rains the\nmud has got washed off, and you are seeing more of it. The washermen of\nChitpur have been using this rock to do our washing for many, many years!\nThere’s nothing miraculous about it. Now off with all of you, I have work to\ndo.’\nSo saying Bholu emptied his bundle of clothes and set to work. What could\nthe others do? They had to go away grumbling quietly to themselves.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Roopa’s Great Escape\nAjja’s and Vishnu Kaka’s houses were teeming with people! There was a\nvillage festival, and friends and relatives from near and far had come to\nShiggaon. There were people the children had not seen or even heard about\nbefore. Some said, ‘I am your father’s fourth cousin.’ Someone else said, ‘I\nam your grandmother’s second cousin.’ The houses were full and there was a\nlot of fun and laughter everywhere. Nobody expected a separate bedroom or a\nspecial dish at the dining table. They all ate together and talked to everybody\nand slept on the floor on mattresses. The city children were surprised at the\nease with which the guests made themselves at home. The women helped out\nin the kitchen in the morning and in the evening they dressed in shining silk\nsarees and went to the fair. In fact everyone dressed in their best, put the two\nhundred rupees Ajja gave in their pockets and purses and made for the fair.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "hundred rupees Ajja gave in their pockets and purses and made for the fair.\nThe fair itself was quite astonishing. The children from Mumbai said, ‘It is\njust like Chowpati on Juhu beach.’ The Delhi kids said, ‘It is similar to\nJanpath.’ Others said, ‘It is like Karaga or Kallekai Parishe in Bangalore.’\nVishnu Kaka explained, ‘In every village there is a village god or goddess and\nonce a year we worship them in a grand way. At the festival and fair it is not\njust about selling and buying, it is also about meeting people, exchanging\ngifts, having a feast and a good time.’\nThe group moved from shop to shop, peeping into the photo studios,\nexamining bangles, waiting for a turn on the merry-go-round and clapping\nalong to the dances, when someone noticed Suma was missing! Somewhere\nin the crowd she had got separated from the rest, and now there was no sign",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "of her. Immediately her mother started wailing, and Ajji consoled her. Vishnu\nKaka too looked really worried. The children were scared and thrilled too.\nThis was just like Home Alone! As Vishnu Kaka was about to make his way\nto the police assistance booth, they heard Suma’s voice on the mike! ‘I am at\nthe police station, Vishnu Ajja please come and fetch me.’ When Suma had\nbeen traced, her mother started scolding her. But Suma was not bothered. ‘I\nwas not worried,’ she said. ‘In the crowd when I realized I was not with you\npeople, I straightaway went to the police station and told them to make an\nannouncement.’\nEveryone declared she was a very brave and sensible girl, and for a change\nthat day Vishnu Kaka said, ‘Today I will tell a story about a young girl like\nSuma who had a lot of courage. I read this story in a book when I was young.’\nOnce, there lived a very clever young girl called Roopa. She was an orphan",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Once, there lived a very clever young girl called Roopa. She was an orphan\nand had been taken care of all her life by the people of the village in which\nshe lived. She was very hard-working and once she became old enough, she\nlived all by herself and looked after herself. But she always missed having a\nfamily of her own, even though her neighbours were such loving and caring\npeople.\nOne day, when Roopa was about sixteen years old, she went down to the\nriver along with some other women and girls to wash clothes and fetch water.\nDiwali was around the corner and everyone was excited. They were\ndiscussing what new clothes they would get. Some were expecting their\nhusbands and fathers to return to the village with lovely gifts for them and\nwere looking forward to all the merrymaking that would happen over the next\nfew days.\nOnly Roopa was quiet. She did not have anyone to buy her new clothes or\nshoes or presents. The villagers were kind to her, but they had barely enough",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "shoes or presents. The villagers were kind to her, but they had barely enough\nfor their own needs so how could she expect them to get anything for her? Yet\ntoday, hearing all the happy chatter around her, she could not keep quiet any\nlonger.\n‘Even I will get a new sari this year!’ she told Rama, her best friend.\nRama and all the other girls were astonished. Who was going to get Roopa\nher new sari? ‘I heard from a distant uncle the other day. He was working for\nmany years in a faraway city and did not know that my parents had died. Now\nthat he is back, he has promised to visit me on Diwali. I am sure he will bring",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "some marvellous gift for me!’ Roopa had started weaving a story, and now\nshe kept adding, telling all kinds of tales about her imaginary uncle. Her\nfriends listened open-mouthed. Then they went home, telling each other what\nluck Roopa was finally no longer all alone in the world.\nAs soon as the bunch of women had gone away, who emerged from behind\na tree, but Bholu the trickster. He had been sitting under the tree, planning his\nnext theft, when he had fallen asleep. Then he had woken up and seen the\nwomen at the river and had sat there still hoping to hear something about the\nvillagers. Sure enough, he had heard Roopa’s story, and was now ready with a\nplan!\nBholu decided to dress up as an old man and appear at Roopa’s house a few\ndays before Diwali pretending to be her uncle! Then he would take her away\nalong with any valuables she may have got from her parents.\nA week before Diwali, an old stranger appeared at Roopa’s door. He was",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "A week before Diwali, an old stranger appeared at Roopa’s door. He was\ncarrying new clothes, sweets and other gifts. Roopa was out doing some\nerrands so her neighbours came around to find out who he was. Bholu acted\nperfectly like Roopa’s long-lost uncle, eagerly waiting to meet her. When\nRoopa returned home, she found everyone sitting around an old man, who\nsaid he was the uncle she had made up a story about!\nRoopa was astonished. How had this happened? She had only been\npretending to have a relative just so her friends would not feel sorry for her,\nand now here he was, a real person! Then her neighbour, who had looked\nafter her all these years, said, ‘Roopa, this is your Uncle Bholu; he learnt he\nhad a niece and came here looking for you. He wants to take you home with\nhim and look after you like his own daughter. You are so lucky, Roopa, and\nwe are so happy for you!’\nRoopa looked around at everyone, beaming happily at her, and thought",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "we are so happy for you!’\nRoopa looked around at everyone, beaming happily at her, and thought\nwhat harm would there be if she went away with this uncle. She happily\npacked whatever little things she owned and waving goodbye to her friends\nand neighbours, went off with Bholu.\nNo sooner had they reached his house than he took off his disguise and\nappeared before her as a young man. Roopa was horrified. Oh, what a fool\nshe had been to believe his story and come away with him! He was nothing\nbut a trickster.\nIn Bholu’s house there was no one else but his mother, who was old and\ndeaf and blind. After eating his lunch, Bholu decided to walk about for a\nwhile, meeting his friends and telling them how he had kidnapped Roopa. She",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "too ate her lunch, pretended she was very sleepy, yawned loudly and told his\nmother, ‘Aunty, I am very tired after that long journey. I am going to bed for a\nlittle while. If your son comes round tell him not to wake me up.’\nBholu’s mother nodded, though she had not heard much. Roopa quickly\nwent to the other room, borrowed some of Bholu’s clothes, wore them and ran\noff. She took with her a few coins and a thick stick to defend herself if need\nbe. Before leaving, she arranged the pillows in such a way on the bed that in\nthe evening darkness it looked like someone was sleeping on the bed. Then\nshe covered the pillows with a dupatta and a sheet. If anyone only looked in\nfrom the door it would seem as if a woman was sleeping on the bed.\nBholu returned home when it was well past evening. His mother told him\nRoopa was in her room. He peeped in, saw someone sleeping and went away.\nMany hours passed, Bholu kept checking whether Roopa was awake or not,",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Many hours passed, Bholu kept checking whether Roopa was awake or not,\nbut each time he saw her sleeping without moving a muscle. Finally, he\nrealized something was wrong.\nHe went up to the bed now and pulled back the dupatta and the sheet.\nImagine his shock when he saw nothing but pillows on the bed! Roopa had\ndisappeared! He ran out immediately and asked everyone around if they had\nseen a young, pretty girl walk out of his house. But no one had, because\nRoopa had cleverly disguised herself as a man!\nMeanwhile, Roopa too had walked many miles till she reached a different\ntown. There she looked around for work, and was taken in by an innkeeper to\nlook after the guests and to show them their rooms. Roopa, who now called\nherself Rupesh, was happy doing this work. She could not return to her\nvillage till she did something about Bholu, otherwise he would be sure to land\nup there and bring her back with him, pretending to be her uncle.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "up there and bring her back with him, pretending to be her uncle.\nAfter many days, Bholu turned up at the town. He walked from shop to inn\nto market, asking if anyone had seen someone like Roopa. Of course no one\nhad. Roopa got to know and decided to teach him a lesson. When Bholu\nreached her inn, he did not recognize her in men’s clothes. She agreed to give\nhim a room for the night. She told him, ‘Sir, I will give you a room in the\nattic. It is nice and warm and cosy there, and you will be away from this harsh\nwinter cold.’\nBholu happily agreed and followed her to the room. A ladder was kept in\nthe middle of the room which went up to a little trapdoor. If you climbed\nthrough the door, you entered the attic. Bholu quickly went up the ladder,\nfound his bed, wrapped his blanket around himself and went off to sleep.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "When it was the middle of the night, Roopa sneaked into the room and\nremoved the ladder. Then she threw some marbles right under the trapdoor\nand stamped loudly around the room. Bholu woke with a start. Who was that\nwalking around his room? He called down nervously, ‘W-who is there?’\nRoopa called out in her man’s voice, ‘Nothing to worry sir. The soldiers are\nlooking for a thief they believe is hiding in this inn.’\nBholu was really scared. How did the soldiers know he was a thief and a\ntrickster? He was sure they were looking for him, and decided to make a run\nfor it. He opened the trapdoor and stepped down. But there was no ladder!\nBholu fell with a loud thud on to the floor! When he tried to get up, his feet\nslipped on the many marbles strewn about the room and he went crashing and\nsliding all over the place! Finally he hit his head against a wall and passed\nout, unconscious.\nRoopa had been watching this from the door with great delight. Her plan",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "out, unconscious.\nRoopa had been watching this from the door with great delight. Her plan\nwas working! As soon as Bholu fainted, she heaved him up and packed him\nup in a large box. She placed a nice silk cloth on top of him. Then she\ndragged the box outside the inn and stood there.\nSoon a bullock cart passed by with two travellers heading for the inn.\nWhen they saw Roopa, or Rupesh, standing outside the inn, they asked, ‘Are\nyou the manager of this inn?’\nRoopa nodded yes.\n‘Why are you standing here then?’\nRoopa replied in a worried voice, ‘I look after this inn. I was supposed to\ngo to my own village earlier today to attend a wedding. But there was so\nmuch of work that I could not leave, and now here I am waiting for my cart\nwith this heavy box.’ Then she lowered her voice and whispered, ‘This box is\nfull of gifts I bought for the wedding, and if I don’t reach in time, everyone\nwill be really disappointed.’\nThe two travellers, who were up to no good themselves, looked at each",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "will be really disappointed.’\nThe two travellers, who were up to no good themselves, looked at each\nother. The same thought had come to both! They said, ‘Don’t worry, brother.\nYou can take a ride on our cart. Why don’t you put your box on the cart here?\nBut before we start, would you mind getting us a drink of water?’\nRupesh, or Roopa, smiled to herself, and dragged the box on to the cart.\nThen she went inside to fetch the water. She took her time. As soon as her\nback was turned, the two travellers opened the box to see what it contained.\nThey saw some lovely silk cloth on top. Now assured that they had got their\nhands on some valuables, they quickly urged their bullocks forward and made",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "a dash for it. Once they were well and truly out of sight, Roopa grinned to\nherself. Her plan had worked! She ran to the nearest police station, and told\nthem all about the theft.\n\n\nThe two men in the bullock cart were just celebrating their theft of the box,\nwhen they were horrified to see soldiers waiting for them down the road.\nWhat could they do, they wondered. They were crossing a bridge over a river\nat that time, and quickly tipped the box into the water. Then they heaved a\nsigh of relief and went their way.\nSo that was the end of Bholu, and Roopa too returned to her village, where\nshe lived happily on her own. She was not going to trust any stranger any\nmore!\n‘And that’s what brave Suma did too! When she was in trouble she did not\ntalk to any stranger, but went straight to the police for help. We must always\nremain cool like this when in trouble,’ signed off Vishnu Kaka. Suma was\ndelighted at this praise, and ate her bhajias with great happiness all the way\nhome!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Five Spoons of Salt\nOne morning, Ajji told Ajja, ‘Today is a Santhe (a village market day which\nhappens once in a week). Why don’t you take the children and show them the\nSanthe and buy vegetables and other things for the house?’ Ajja, who\nnormally would have said yes, was hesitant. ‘How will I manage all the\nchildren, that too at the Santhe? Remember what happened at the jatre—the\nfair? At least there they had a temporary police assistance booth. There will\nbe nothing of the sort at the Santhe.’ Ajji agreed. This was a problem. Then\nshe had an idea. ‘Why don’t we ask Vishnu if he can spare Damu for a few\nhours? Damu can accompany you and help see that the children are all right.’\nDamu was Vishnu Kaka’s right-hand man. Everyone called him ‘Mr\nDependable’. He drove the car, cooked, looked after the fields, the accounts\nand made sure Vishnu Kaka was well cared for. Without him, Vishnu Kaka\ncould not run the house or do anything in the fields. Vishnu Kaka’s son lived",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "could not run the house or do anything in the fields. Vishnu Kaka’s son lived\nwith his family in Delhi and came only for holidays, so Damu was his real\ncompanion.\nSo it was that all seven children and Damu and Ajja were now ready to\nvisit the Santhe. Damu had a plan. ‘The Santhe is only two kilometres away.\nWhy don’t we walk, and let your Ajja go in the auto?’ The children were\nhorrified. Walk for two kilometres in the heat! ‘It would be so boring too!’\nadded Raghu. But Damu had made up his mind. ‘Walk with me. I will tell you\nsuch wonderful stories that you will forget everything, even the heat!’\nThe children agreed. Then Meenu had a condition. ‘It has to be a true story,\nDamu Anna!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Damu was unfazed. ‘I’ll tell you a story about my sister. Do you know how\nI came to be “Mr Dependable”? I saw what happened to her once because she\nwas forgetful and decided never to let that happen to me.’\nSo he started his story.\n‘Gita, where are you? I need you to run down to the store and get these\nmedicines for me!’ Gita’s grandfather called out for her. Where was Gita? She\nwas lying in bed, reading a book! For a long time she pretended not to have\nheard what her grandfather was saying. The book was just too exciting, and it\nwas so hot outside, she really did not feel like stirring out of bed.\n‘Gita!’ This time her mother’s voice also called out to her. With a sigh, the\ngirl got out of bed and went to see what needed to be done. Her grandfather\nhanded her some money and said, ‘I have a really bad headache since\nmorning. Will you get these medicines for me?’\nGita took the money and set off for the store. On the way she passed by a",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Gita took the money and set off for the store. On the way she passed by a\nsweet shop. Oh, what lovely gulab jamoons and laddoos and jalebis were\ndisplayed! She had to have some. Forgetting all about her errand she entered\nthe shop and started tucking into sweets. Soon a friend came by and joined\nher. The two girls ate and chatted for a really long time. Gita had forgotten all\nabout her poor grandfather with his headache! Afternoon turned to evening,\nthe medicine store shut for the day, when Gita remembered why she had\nstepped out of her house. When she hurried back home, how upset her\ngrandfather was. ‘When will you grow up, Gita, and become responsible?’ he\nsighed and asked.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Gita felt really bad, but did she mend her ways? No, she remained the same\nforgetful person. When her mother told her to collect the clothes from the\nwashing line outside, she remembered to do so only the next morning! By\nthen, the clothes were soaked through all over again because of the overnight\nrains. Another day, she had to take her sister’s lunchbox to the school. On the\nway she saw a circus was in town. All morning Gita spent wandering around\nthe circus tents, watching the animals eating and training for their acts. It was\nonly when she felt hungry herself did she look down at the lunchbox in her\nhand and realized her sister must have gone home by then, after spending a\nday in school without her lunch.\nAnother time her father, while rushing to get ready for work, asked if she\ncould quickly iron his shirt. Gita picked up the shirt and placed it on the\nironing table next to the window. Just then the fruit vendor passed by with",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "ironing table next to the window. Just then the fruit vendor passed by with\nbig, fat, juicy mangoes in his basket! Of course Gita forgot all about the hot\niron sitting on the shirt and got engrossed in choosing the best mangoes to\nbuy. Only when smoke started billowing out and the shirt had burnt as crisp as\na toast did she look around and see what had happened. Her father was very\nupset indeed that day.\nSome days after this incident, Gita came home from school and announced\nthat the whole class was being taken for a picnic the next day. The teacher had\nasked each student to bring one food item from home which would be shared\nby all the children. Gita had chosen to bring sambar. She was very proud of\nher mother’s tasty, tangy sambar and was eager to share it with her friends so\nthey could taste it too. Gita’s mother agreed to make a big pot of sambar for\nher to take to the picnic the next day, and that night Gita went to bed feeling\nvery happy, dreaming about the exciting day ahead.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "very happy, dreaming about the exciting day ahead.\nThe next morning, her mother woke up early and started making the\nsambar. She boiled the dal, added the vegetables, coconut and all the spices,\nand set the pot boiling on the stove. Soon a delicious aroma wafted out from\nthe pot and tickled Gita’s nose as she lay sleeping in bed. Seeing her stir, her\nmother told her, ‘Gita wake up now, dear. See the sambar is nearly done. I am\ngoing to the temple, so after some time just add five teaspoons of salt to it.\nDon’t forget now, and wake up and get ready quickly!’\nSo saying she bustled off. Gita’s grandmother, who was in the kitchen,\nheard all this and muttered to herself, ‘When will my daughter-in-law learn\nthat Gita can never remember anything. I’m sure the girl will forget to add the",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "salt. Then she will be teased by all her friends. Better be careful.’ So saying\nshe went and added the salt in the pot.\nGita’s grandfather was sitting on the veranda reading his newspaper. He\nremembered only too well the day he had spent with a headache waiting for\nGita to return with the medicines which never came. ‘Gita and remember\nsomething? That’ll be the day!’ he muttered, and went into the kitchen and\nadded the salt in the sambar himself.\nGita’s sister was combing her hair, ready to go off to school. She too\nrecalled the day she had spent feeling hungry in school waiting for Gita to\nturn up with her lunchbox. Sure that Gita would forget about the salt and be\nlaughed at by her friends, she quickly went into the kitchen and added five\nspoons of salt.\nGita’s brother was brushing his teeth and hearing his mother’s words to his\nsister, guessed she would forget about the salt. He dropped in a few spoons of\nsalt into the pot and went off.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "salt into the pot and went off.\nGita’s father was carefully ironing his own shirt. Like the others he too\nslipped into the kitchen and added salt to the pot of sambar.\nBy now Gita had woken up and wonder of wonders, remembered she\nneeded to add the salt! So she too went and added five teaspoons as her\nmother had told her to do. By now her mother had returned and quickly\npoured the sambar into a big container and sent her daughter off for her\npicnic.\nAt the picnic spot the children had a wonderful time, roaming around and\nplaying. Soon they were too hungry to do anything else. Out came the plates\nand spoons and all the containers filled to the brim with food. Plates were\npiled up with rice, chutneys, vegetables, pooris and all kinds of goodies.\nEveryone took large helpings of the sambar as Gita served it out. But no\nsooner than they put the first spoonful in their mouths, ‘Blaagh! Horrible!\nWater!’ everybody started shouting. Astonished, Gita wondered what was",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Water!’ everybody started shouting. Astonished, Gita wondered what was\nwrong, then gingerly tasted the rice and sambar on her own plate. It was\ndisgusting! It was as if her mother had dredged out all the salt in the sea and\nadded it to the sambar! Then Gita remembered, her mother had not added the\nsalt, she had! So what had gone wrong?\nThat day everyone in Gita’s house waited eagerly for her to get back from\nschool and tell them about her wonderful outing. But what was this? She\ncame trudging back, her face sad and tear-stained. What had happened? Gita\nburst out at them, ‘Did anyone else add salt in the sambar?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘I did!’ said her grandmother.\n‘I did too!’ said Grandfather.\n‘So did I!’ said Father.\n‘Me too!’ said her brother.\n‘And I!’ said her sister.\nThey all looked at each other in dismay. No wonder Gita looked so sad.\nHer friends would have made her feel miserable about the salty sambar!\n‘Why did you all do it? Amma had told only me to do so!’ Gita wept.\n‘Oh dear, you forget everything you are told to do, so we thought . . .\nperhaps . . . you wouldn’t remember this time too,’ all of them said sadly.\nNow her mother pulled her close, wiped away her tears and said, ‘See, all\nthis happened because no one could believe you could do anything without\nbeing reminded many times about it. Promise you will be a careful,\nresponsible girl from now on, and we will all trust you to do your work.’\nGita sniffed and nodded her head. She did become much more careful with\nher chores after that. And it took a lot of convincing, but her friends did come",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "her chores after that. And it took a lot of convincing, but her friends did come\nto her house for lunch one day to taste her mother’s delicious cooking,\nespecially her tasty, tangy sambar, and everyone agreed it was the best sambar\nthey had ever eaten!\nWhen the story was over, the children realized they were already at the\nSanthe. There were heaps of vegetables, sweets, flowers all around. There\nwere goats, cows, buffaloes, fish, chicken and eggs for sale. The smell of\nnuts, cardamom and other spices hung in the air. It was unlike the fair where\npeople had come to have a good time. Here a lot of business was taking place\nand everyone was buying and selling busily. The fruits and vegetables were\nvery fresh. The flowers looked as if they had just been plucked. Everyone was\nfriendly.\nThe fruit vendor saw Ajja and said, ‘Namaste Masterji. Oh! You have come\nwith your grandchildren. It is nice to see everyone like this.’ Then he gave",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "with your grandchildren. It is nice to see everyone like this.’ Then he gave\neach one a mango. When Ajja offered money, he wouldn’t take it. He said,\n‘After all you were my masterji, my teacher. Can’t I give seven mangoes as\ngifts to your grandchildren? They are from my garden, not that I purchased\nthem.’ The children were delighted at his warmth and kindness and returned\nhome very happy that day.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "How the Seasons Got Their Share\nIt was an unusually hot afternoon, and there was a power cut. The children\nwere sitting in the house, wiping their foreheads and complaining. ‘How do\nyou stay without electricity, Ajja?’ asked Raghu. ‘In Mumbai, in our\napartment, if ever the electricity goes off, the generator comes on\nautomatically. We never even know that the power has gone.’ Ajja looked\naround at the hot, sweaty faces, and said, ‘All right, I’ll show you a place\nwhich is as cool as an AC room. And it stays that way without any electricity!\nCome on everyone, grab a mat each and follow me.’\nThe children were intrigued. Ajja walked out into the garden, crossed it,\nright till the old neem tree that stood in a corner. Ajja told them to spread their\nmats under the tree and lie down. It was deliciously cool and comfortable\nunder the tree. Everyone lay down and looked up at the gently moving leaves\non the great branches over their heads. This was so much more fun than lying",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "on the great branches over their heads. This was so much more fun than lying\nin a closed room! Ajja too had pulled up a comfortable old easy chair and was\nnodding off. After some time he said, ‘This is why I love summer! What\nseasons do you children prefer?’\nImmediately Anand said, ‘I too like summer, because there is no school,\nand we can eat ice cream and mangoes. We can also go swimming.’\n‘I don’t like summer, I like winter. You can wear colourful sweaters and eat\ndifferent kinds of fruits. It is nice and cosy to be at home. You can drink hot\nsoup and hot chocolate,’ said Krishna.\n‘I don’t like winter, I get ear pain. I prefer the rainy season. It is so nice\nwhen it rains and all the trees look so fresh and happy,’ said Meenu.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘What about you, Raghu? Why are you silent?’ Ajja asked.\n‘I like all the seasons, provided someone like you or Ajji is there with us.’\nAjja smiled. ‘Well, each season has its own beauty and use. We could not\ndo without even one.’\n‘How is that?’ asked the children.\n‘Okay, I will tell you a story about what happened once when the seasons\nstarting fighting with one another.’\nGod stepped back and looked happily at the Earth he had just created. He had\nfilled it with humans, animals, trees and seas and it looked a wonderful place\nto be in. But something was missing. After thinking for a while, he called out\nto six brothers: Day, Night, Summer, Winter, Monsoon and Wind. He\ncommanded the six brothers to go down to Earth and help the creatures there\nlive comfortably and prosper. ‘You must help the creatures on Earth grow\nfood and live comfortably. I have divided Time into two parts—twenty-four\nhours and 365 days. You must share this among yourselves so that people on",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "hours and 365 days. You must share this among yourselves so that people on\nEarth get all that they need.’ The six brothers nodded obediently, but no\nsooner was God’s back turned than they all started quarrelling!\nEveryone wanted a big share of the time available to spend on Earth. Day\nand Night decided each would get twenty-four hours each. But the seasons\nkept quarrelling. Summer was the eldest, so he said, ‘I will be on Earth for\n365 days first!’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Rain said, ‘If I don’t show up all the water on Earth will disappear, so I will\ncome next.’\nWinter said, ‘After the rains I help trees to flower, so I will come in the\nthird year.’\nPoor Wind was the youngest and no one paid him any attention, so he got\nthe last year.\nSo life started on Earth. For twenty-four hours at a time there was Day,\nthen twenty-four hours of Night. Summer continued for one whole year.\nWhile in the beginning the heat helped the crops to grow, soon it became too\nhot for anyone to do anything. All the water dried up and there was great\ndiscomfort. The people of Earth pleaded with Summer to stop and he had to\nleave before his year was up.\nThen it was the turn of Rain. When he started pouring down, how happy\neveryone was to get some respite from the year’s summer. But soon the lakes,\nponds, rivers, oceans all filled to the brim and started overflowing. The crops\ngot spoilt in the rain and there was nothing for anyone to eat. When people",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "got spoilt in the rain and there was nothing for anyone to eat. When people\nprayed for him to stop, he had to step aside and make way for Winter.\nWith relief people greeted Winter. Now there was neither the scorching sun\nnor the pouring rain. But when day after day went by like this they started\nfalling sick from the constant cold, the plants started dying because of less\nsunshine. At the people’s request Winter too had to stop.\nNow it was the turn of Wind. Within a few days of his constant huffing and\npuffing people were scared to step out anywhere. Trees were uprooted, the\nroofs of houses went flying and there was chaos all around.\nThe brothers realized what they had done would displease God mightily. So\nthey decided to change their ways. Instead of each taking a year they decided\nto share one year among each other. But again, Wind being the youngest got\nleft out and got no time for himself. He sat in a corner and sulked.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "left out and got no time for himself. He sat in a corner and sulked.\nDuring summer time people sowed their crops and waited for the rains.\nRain came with loads of water but there was no wind to distribute it equally.\nSome parts of Earth got buckets of rain and other parts none at all. Now\neveryone realized that Wind was as important. They called out to him and he\nfinally agreed to do his work. But he did not get a separate time for himself.\nHe was allowed to blow all through the year. So in Summer he blew and\nhelped reduce the heat. During rains he blew the clouds from one place to\nanother and took rainwater everywhere. In Winter he still blew and made it\neven colder!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Day and Night too learnt from the four brothers and decided to divide the\ntwenty-four hours equally. So one half was Day and the other was Night.\nNow everyone on Earth was happy, and the six brothers learnt to share their\ntime.\nBy this time Ajji called from the house, ‘The electricity is back. You can\ncome inside now.’ But the children were happy to remain outside and enjoy\nthe breeze.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Island of Statues\nOne day, early in the morning, the children heard a loud voice booming\noutside. ‘Where are your grandchildren? I have come to take them to my\nplace.’ They went running out to see a very tall man with twinkling eyes and a\ngrey beard sipping coffee with their grandparents. He wore a crisp white dhoti\nand shirt and a black cap. His smile was so charming that the children\ninstantly warmed to him. Ajji was shaking her head and saying, ‘Rehmat,\nthere’s no way Peerambhi can manage four children. Take them out for the\nday, why do you want to have them over for the night?’ But the man called\nRehmat shook his head. ‘No no, I will take them for a night’s stay. My Usman\nis a great cook and will look after everything. Peerambhi will not be troubled\nat all.’\nAjji saw the questioning look on the children’s faces and explained, ‘This is\nRehmat. A long time back when your Ajja was a schoolteacher, he was your",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Rehmat. A long time back when your Ajja was a schoolteacher, he was your\nAjja’s student. He lives a little far away now. He has a mango grove there,\nand a large house. All his children live abroad. In his house there’s a large\nlibrary of books and what can be called a mini zoo with goats, cows,\npeacocks, pigeons and parrots. He wants to have you all over for the night.\nI’m sure you’ll have a good time, but do you want to go?’\n‘He also tells very beautiful stories,’ added Ajja.\nRehmat grinned and said, ‘Masterji, don’t exaggerate. I started reading\nchildren’s storybooks only after my grandchildren were born. Then I\nremembered the stories you used to tell us in school and passed off some of",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "them as my own.’ He turned to the children and said, ‘So what do you think,\nkids, will you come with me? I will show you a different part of the village.’\nEveryone was thinking, when Raghu spoke up, ‘Can we bring our friends\nwith us?’\n‘Oh, you mean Vishnu Kaka’s grandchildren? Of course they can come.\nThe more the merrier. Peerambhi will love having so many children in the\nhouse.’\nRaghu ran to Sharan’s house to give the news.\nRehmat Chacha, as everyone called him, had brought a jeep and soon all\nseven had packed a change and their toothbrushes and piled into it. Rehmat\nChacha’s house was far, about thirty kilometres away, and on the way they\nhad to go through a forest. The road cutting through the forest was narrow and\nwinding. Tall trees stood on both sides. It was a dark, scary place. Suma\nlooked around nervously and said, ‘Will anyone ever cut down these trees and\nwiden the road?’\nRehamt Chacha shook his head. ‘Oh no, the villagers will never allow it.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "widen the road?’\nRehamt Chacha shook his head. ‘Oh no, the villagers will never allow it.\nWe love our trees and try to see as few are cut down as possible. Trees must\nnever be cut unnecessarily. Do you want to listen to a story about a kingdom\nthat cut down all its trees?’\nOf course the children did, so Rehmat Chacha began his story.\nOnce there was a beautiful verdant green island. It had forests filled with huge\ntrees, waterfalls gushing with clear blue water and mountains where there was\na quarry of a unique kind of stone. This stone was valued for its attractive\nwhite colour. It was also easy to turn into sculptures.\nThe island had been ruled for years by a king who was now old. He looked\nafter his people well and loved the natural beauty of his land above all. His\nclosest friend was a sculptor called Amar. Amar too loved the land more than\nanything else. He had a school where students from far and wide came to\nlearn the art of creating sculptures out of stone. But Amar had one odd",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "learn the art of creating sculptures out of stone. But Amar had one odd\ncondition for the students who studied in his school. He insisted they bring\ntheir own supply of stone! Only for their final sculpture were they allowed to\nuse a piece of stone from the island’s quarry. Many grumbled at this rule.\nAfter all, dragging tons of stone to an island in the middle of a sea was\ndifficult, but Amar was adamant.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Once his king asked him the reason for this condition, and this is what wise\nold Amar had to say: ‘This stone and indeed everything on this remarkable\nland of ours is a gift which we need to preserve. Unless we use it wisely how\nwill we be able to save this quarry for our children? If we start using the\nstones and woods from trees without a thought they will soon finish and then\nwe will be left with an empty, barren land. This is why I insist that students\nlearning the craft of sculpting bring their own material, and only when they\nmake their final piece of art can they use this unique stone from our land.’\nThe king applauded this thought in his mind and let Amar run his school\nthe way he wanted. But then a day came when the king, now very old, died,\nand his son took over the throne. Rajdip, the new king, wanted to do\neverything differently from his father. He started changing many laws. One\nday he remembered the art school and went to visit it. There he saw the",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "day he remembered the art school and went to visit it. There he saw the\nstudents working on their sculptures. But his ministers whispered to him the\ncomplaints that other students, who had not wanted to bring their own\nmaterial, had made about Amar’s rule.\nRajdip realized that if he lifted the rule then many more people would come\nto study in the school. Their fees would add to the prosperity of the island and\nin addition they would create lovely works of art that could be used to\nbeautify the towns. He ordered Amar to step down as the teacher and brought\nsomeone else to run the school.\nSoon the island was full of students chipping away on the stone. Their\ndemands increased the mining at the quarry. They created large sculptures\nwhich now needed to get transported back to the town. Trees were cut down\nto make carts and to clear roads. Without trees to provide wood for their boats\nthe fishermen of the island could not go out to sea. They started fishing near",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "the fishermen of the island could not go out to sea. They started fishing near\nthe land and got into fights frequently with one another. New houses were not\nstrong as both wood and stone were scarce. It was difficult for farmers to\nmake good ploughs and so farming suffered. All the mining created so much\nof pollution that plants started dying out, diseases spread, and the tinkling\nwaterfalls fell silent as water became scarce. The climate changed, it became\nhotter and drier. Soon there were famines and the once beautiful green island\nwas reduced to a wasteland of weeds and scrub.\nRajdip’s wishes of lining his capital city and palace with giant sculptures\nwas fulfilled. Each student in the art school made a beautiful huge statue and\ngifted it to him. Soon these statues filled up the entire kingdom. Where once\nthere were deep forests and blue rivers and streams, the island was a barren",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "land now. The forests were gone. The rivers had turned into dirty trickles of\nwater. The climate had become hot and dusty as the rains no longer came on\ntime. People started leaving the island. The houses, schools and palaces\nslowly fell silent as they were abandoned. With time, everyone forgot about\nthis island. Many, many years later when explorers landed here, they found\nhundreds of statues strewn all over a bare island: a land destroyed by the\nking’s greed.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "How everyone enjoyed the story. The rest of the journey was spent in each\none acting out a part from the story, with Rehmat Chacha taking on the role of\nthe wise old king. Cheerful and at the same time very hungry, they soon\nreached their new friend’s house.\nIt was a huge rambling place. Peerambhi was waiting for them at the\ndoorstep. She told Usman to make a sherbet of mango, and Shurukumbha (a\nkind of kheer) for lunch. There was also paratha, biriyani, and all kinds of\nmouth-watering dishes which Usman was more than happy to prepare. After\nlunch they roamed around the house, examined the books in the library and\nthe many awards Rehmat Chacha had received for his innovative skills in\nagriculture.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Kingdom of Fools\n‘Rehmat Chacha, you must be very intelligent. You know so much about\nfarming, fishing, stories and so many other things,’ Meenu remarked that\nnight as they sat outside, watching the fireflies twinkling all around them.\nBut Rehmat Chacha did not agree. ‘No, not really. There is plenty I still\ndon’t know. In fact, one can never stop learning. Knowledge is the only thing\nit’s good to be greedy about.’\nIt was a beautiful, clear night. The moon and stars shone in the black,\nunpolluted sky. Peerambhi was feeling very happy. Her own grandchildren\nlived so far away, and came to visit her only once in two or three years. After\nso long the house was filled with laughter and young voices. She was too frail\nto do much, and was enjoying sitting among them and talking to them.\nSoon they started yawning and rubbing their eyes. But no one was going to\nbed till Rehmat Chacha told another story!\nThere once lived a king who was very intelligent. He looked down upon",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "There once lived a king who was very intelligent. He looked down upon\nanyone he thought was dull. He was also very proud about the fact that in his\nkingdom there were no stupid people.\nSome distance away from the capital city lived an old teacher. He had\ntaught the young prince, who was a sweet-natured boy once but had turned\ninto a proud, rude king. Many people told him about the king’s boastful\nnature, and the teacher decided to teach his old pupil a lesson he would never\nforget. He called his three best and brightest students, Harish, Mahesh and",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Umesh, and said, ‘We need to bring that proud king down a peg or two. I\nwant the three of you to teach him a lesson and make him realize the\nfoolishness of his pride.’\nThe three students set off for the capital. Harish walked to the city market.\nThere he met a man selling betel leaves.\n‘How much for these leaves?’ he asked.\n‘Ten rupees for two hundred leaves,’ the shopkeeper replied.\n‘Here are ten rupees. Give me only twenty-five leaves. My servant will\ncome and collect the balance one hundred and seventy-five leaves.’\nThe betel-leaf seller agreed and gave Harish twenty-five leaves.\nHarish now strolled into another shop where beautiful shawls were being\nsold.\n‘How much for this?’ he asked, fingering the best shawl in the shop.\n‘Two hundred rupees,’ answered the shopkeeper.\n‘Here are twenty-five rupees. You can collect the remaining hundred and\nseventy-five rupees from the paan shop there,’ Harish said, handing the\nshopkeeper a note.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "seventy-five rupees from the paan shop there,’ Harish said, handing the\nshopkeeper a note.\n‘Please give the person who brings this note the remaining one hundred and\nseventy-five,’ the note read. The shawl shop owner sent his servant with the\nnote to the paan shop to verify if indeed this was true. The other shopkeeper\nglanced at the note and said, ‘Yes, it’s true. I have to give him one hundred\nand seventy-five more. Come back in half an hour—I will count and keep\nthem ready.’\nThe servant returned and whispered to his master: indeed, the betel-leaf\nseller was going to give them the remaining one hundred and seventy-five.\nHarish walked out with the shawl. After half an hour, when the servant went\nto collect the money, he found the shopkeeper busy counting out leaves.\n‘Hundred seventy-three, hundred seventy-four, hundred seventy-five . . .\nThere you go, here are the rest of the leaves.’\nThe servant was amazed at being handed a sheaf of paan leaves instead of",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The servant was amazed at being handed a sheaf of paan leaves instead of\nmoney. He called his master and the two shopkeepers started arguing loudly.\nSlowly they realized that someone had made fools of them. They rushed to\ncomplain to the king.\nThe king was surprised to hear how a stranger had tricked the clever\nshopkeepers of his kingdom. He decided to keep a lookout for this man.\nThe next day, Mahesh walked into the royal carpenter’s shop. It was the\nmiddle of the afternoon and the carpenter was in his shop tinkering with some",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "strange-looking instruments. Mahesh was well dressed, so the carpenter\nthought he was rich. Enthusiastically he started showing off his various\ncreations. He picked up a large wooden lock and said, ‘See this? Will you\nbelieve that with this you can even lock a man? Place the person’s head\nbetween the lock and a pillar and turn the key, and there, the man cannot\nescape.’\nMahesh pretended to be sceptical. ‘Go on now. How can a simple wooden\nlock do such a thing? I don’t believe you.’ The carpenter got very agitated.\n‘But it’s true, sir. I am the king’s carpenter after all. I create many complicated\ninstruments for the state. Here, let me show you.’ Saying this, he put the lock\naround his neck and the nearest pillar and turned the key. ‘Now, see? I cannot\neven move my neck! Are you convinced? Now just turn the key the other way\nto set me free.’\nBut Mahesh would not turn the key. He just stood there laughing. Then he",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "to set me free.’\nBut Mahesh would not turn the key. He just stood there laughing. Then he\ncoolly picked up the key and walked out of the shop. The carpenter could\nonly shout at Mahesh’s retreating back. ‘You villain! Come back! Set me\nfree!’ But it was in vain. Mahesh had fooled him.\nLater that evening the king came to know of this other stranger who had\nduped his clever carpenter. He was worried. Who were these men, making the\nbrightest people of his kingdom look stupid? He decided to go around the city\nin disguise to try and catch them.\nAs he walked near the city gates, he found a man sitting there with a heap\nof mangoes, waiting for someone to buy them. The fruit seller had chosen the\nloneliest spot, so the king was suspicious.\n‘Why are you selling your fruits here?’ he asked.\nThe fruit seller was actually Umesh. He pretended to look nervously\naround and answered in a whisper, ‘Sir, I have heard there are some clever",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "around and answered in a whisper, ‘Sir, I have heard there are some clever\ncheats roaming around the kingdom wanting to cheat us and our clever king. I\nhave heard one will be walking by this way soon, so I am waiting here hoping\nto catch him and deliver him to the king.’\nThe king was surprised that this person knew all about the clever gang of\ncheats.\n‘Have you seen him before?’\n‘Yes, sir. I know the gang. The person who is coming today is the chief.’\n‘What does he look like?’\n‘He is tall, hefty and very cruel.’\n‘Is there any way I can see him?’ the king asked excitedly.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Sir, the best way is to hide. As soon as he comes, I will whistle, and you\ncan see him.’\nBut at that spot there was neither a tree nor any rock behind which the king\ncould hide. Then the fruit seller held out a sack. ‘Hide in this, sir,’ he\nsuggested. ‘I will keep you next to me, and anyone will think it is a sack of\nmangoes.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The king agreed and hopped into the sack. Quickly Umesh tied it and\nwalked away, laughing. The king soon realized he had been tricked. But he\nwas tied in the sack and could do nothing. Many hours later, when his soldiers\ncame looking for him, he managed to wriggle around in the sack and attract\ntheir attention. How embarrassed he was, to be set free by them! He also\nknew now that he and the people of his kingdom were not as clever as he\nloved to boast. He realized his mistake.\nThe king’s old teacher came to the court and explained how his three\nstudents had tricked everyone. Harish, Mahesh and Umesh apologized for\ntheir actions. And the king promised to rule his kingdom with wisdom and\nhumility.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Story of Silk\nNo sooner had the children gotten over their excitement of the visit to Rehmat\nChacha’s house than Ajji sprung another surprise. There was a wedding in the\nvillage! Having attended some village weddings earlier, the children knew\nwhat to expect. Here, it was not like the city where you went at a certain time\nprinted on the card, gave your present, ate and came back. In the village,\neveryone was invited, whether your name was on a card or not. And not only\nwere you expected to come as early as possible, you were also expected to\npitch in and help the host! So Damu was seen rushing off in the jeep to pick\nup guests from the railway station. Rehmat Chacha was in charge of\nproviding fresh vegetables from his farm. Ajji was herding a group of women\ninto the kitchen and telling them what to do. Ajja was supervising the\ncleanliness and had stocked up on big bottles of phenyl and other cleansers.\nAnd Vishnu Kaka was dressed in his best, most spotless dhoti and kurta and",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "And Vishnu Kaka was dressed in his best, most spotless dhoti and kurta and\nwas looking after the guests.\nAjji told the children to wear their nicest clothes and come to the venue.\nKrishna, always careful of the way she looked, wore her pretty blue silk\nfrock. Ajji noticed and said, ‘Krishna, remember to be careful. There will be a\nlot of people and food there. Don’t get your clothes dirty.’\nKrishna promised to be careful. Soon Ajji disappeared into the kitchen\nwhich was lined with people chopping and stirring and cooking. Outside,\nguests were pouring in and Vishnu Kaka was making sure everyone was\nserved breakfast. Ajja was seen hurrying about with a bottle of phenyl in his\nhand. Rehmat Chacha was taking care of the flower decorations while",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Peerambhi Chachi was stringing piles of garlands. Children were playing all\nover the place, film songs played on the mike and there was a happy chaos\neverywhere.\nAfter the wedding, during lunch time, while eating sweet pancakes of\nchiroti with badam milk, someone jostled Krishna and a big puddle of milk\nfell on her dress. She was grief-striken. Ajji consoled her. ‘Don’t cry. Silk can\nbe washed and made to look just like new. That is the wonderful thing about\nit.’ Seeing Krishna’s tear-stained face she said, ‘Today when we go home I\nwill tell you the story of how silk was made for the first time.’ That made\nKrishna happy. That night, though Ajji was tired, she still told the children the\nstory of silk.\nDid you know that silk was discovered in China?\nA long time ago, in a tiny village in China, there lived a poor girl belonging\nto a weaver’s family. One day, the emperor was passing through the village\nand saw her working in the fields. He noticed her red cheeks and rosebud-like",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "and saw her working in the fields. He noticed her red cheeks and rosebud-like\nmouth, her proud bearing and her rough, work-worn hands, which meant she\nworked very hard through the year. He immediately fell in love with her and\nthough he was much older, decided to marry her.\nThe girl married the ruler of the land and went to live in his palace as his\nbeloved queen. But she was unhappy. She had grown up in the wide open\nspaces of the countryside, and now she was confined to a palace, magnificent\nthough it was. She was used to working from dawn to night without a\nmoment’s rest, but now she had many servants to take care of her needs and\ndid not know how to fill her time. In the village she had been surrounded by\nfamily and friends who exchanged news and gossip as they worked, but in the\npalace it was quiet and no one spoke out of turn. The emperor noticed his new\nwife was sad and tried his best to make her happy. He bought her grand",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "wife was sad and tried his best to make her happy. He bought her grand\nclothes, jewels and artefacts, threw elaborate parties, hired the best musicians\nof the land to amuse her. Yet she was sad.\nOne afternoon, the empress sat under a mulberry bush in her garden, lost in\nher thoughts about her village. She slowly sipped hot water from a cup.\nStaring up at the blue sky, the girl remembered the birds that flew over her\nvillage. Then, sighing softly to herself, she picked up her cup to take another\nsip. But what was this! A cocoon from the mulberry bush had dropped into\nthe hot water! Her first thought was to throw away the water and the cocoon.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "But then she took a closer look, and she saw some threads peeping out from\nthe cocoon. Where had they come from? She pulled the threads. They were\nthin, strong and shiny. She kept pulling and a long line of thread came out.\nNow the empress had a great idea. She would take the thread from many\ncocoons and weave soft, strong cloth from it!",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "She called her servants and everyone got to work. They took cocoons out\nof the mulberry tree, dropped them in hot water, and removed the thread.\nThey gathered a fair amount of yarn. Then the queen ordered a special\nweaving machine and wove the first piece of cloth using this new thread.\nThus silk, the best and brightest form of cloth, was weaved.\nThe manufacture of silk spread throughout China. It was the cloth that only\nroyalty could wear, and was much in demand in lands as far away as Rome.\nThe route through which silk was traded between China and Europe through\nAsia was called the Silk Route.\nNow that the Chinese had learnt how to make silk cloth, they did not want\nto share this knowledge with anyone in the world. Generations of Chinese\nroyalty were sworn never to reveal the secret to anyone. When princesses got\nmarried and went away to far-off lands, they were not allowed to tell anyone\nin their new home how silk was made.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "in their new home how silk was made.\nMany, many years later, when a clever princess was leaving her house on\ngetting married, as was the custom, her bags were searched carefully to check\nthat she did not carry anything that would help her make silk. This princess\nhad been weaving silk from a young age and wanted to continue to do so\nwherever she went. She had hidden the cocoons in her long, elaborate hairdo.\nNo one thought of looking there! When she went to her husband’s house, she\ntook out these cocoons from her hair and started gathering silk thread! In this\nway, legend goes, the knowledge of how to make silk left China.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "When Yama Called\nOne day, Ajji was sitting and stitching a tear in an old sari. The children came\nand sat around her. The holidays were finishing and they did not want to be\naway from her for even a minute. Meenu and Krishna affectionately put their\narms around Ajji’s neck and said, ‘Ajji, why do you have so many wrinkles\non your hand?’\n‘Because I am old,’ said Ajji.\n‘Why do old people have wrinkles?’ asked Meenu.\nAjji took off her glasses, which she wore only when sewing or reading, and\nsaid, ‘Once upon a time I was also young like you. My skin was smooth and\nshiny. My hair was long and black. I had very sharp eyes and an excellent\nmemory. But as I grew older, everything changed slowly.’\n‘We will all grow old like this one day, shan’t we?’ asked Divya.\n‘Yes, every living being gets old. It is a part of life. Come, I will tell you a\nstory about old age.’\nMany, many years ago, there lived, in a little town, a man named Arun. He",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "story about old age.’\nMany, many years ago, there lived, in a little town, a man named Arun. He\nwas a merchant and though not very rich, he lived comfortably enough. He\nhad a large family of brothers, sisters, wife and children. He looked after them\nwell, and in whatever way he could, he also helped out the poor people in the\ntown. He built rest houses for travellers, and in these there were dining halls\nwhere anyone could come and have a good, wholesome meal for very little\nmoney.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "One day, while returning home from work, he happened to pass by one\nsuch rest house. It had a veranda where people stopped and rested. Sitting\nthere, looking tired and hungry, was a stranger. He was a tall man. His clothes\nwere travel-stained and showed that he had come from afar. With him was his\nhorse, looking as tired and hungry as its master.\nSeeing them, Arun’s kind heart melted, and he went up to speak to the man.\n‘Where have you come from, my brother?’ he asked. ‘Why don’t you step\ninside for a hot meal and some rest?’\nThe man looked up, gave a smile and said, ‘The rest house is very popular.\nThere is no room for me, and the dining hall is full too. I will wait here for a\nwhile, then be on my way. I’m sure I will find another place to serve me some\nfood down the road.’\nArun would not hear of this. The thought that someone was going away\nwithout food and rest was too much for him. He insisted on the man coming",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "without food and rest was too much for him. He insisted on the man coming\nback to his house with him. There he invited the traveller to share a meal with\nhis family. The man was served lovingly and ate his fill.\nWhile he sat eating, the man noticed that Arun was sometimes a bit absent-\nminded. It was as if something was on his mind, and he was worried. Once\nthey had finished eating and had washed up, the traveller rose to leave. He\nthanked Arun for his kindness, then said, ‘If you don’t mind me asking, sir, I\ncould not help but notice that you were a bit worried. I know I am a stranger\nto you, but perhaps it would help lighten your burden if you shared your\nworries with me.’\nBut Arun only smiled and shook his head. He did not want to share his\nthoughts with the stranger.\nThen the man said, ‘Perhaps if I show you who I really am you will confide\nin me.’\nAnd in a trice the man changed. He was no longer a tired traveller, but a",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "in me.’\nAnd in a trice the man changed. He was no longer a tired traveller, but a\ngod, resplendent in shimmering clothes with a crown on his head. His horse\nchanged into a buffalo, and the man introduced himself, ‘I am Yama, the lord\nof death. Now will you tell me what’s wrong?’\nSeeing this Arun nearly fainted. The lord of death had just shared a meal\nwith him! ‘Wh-what are you doing on earth, my lord?’ he gasped.\nYama smiled and said, ‘Oh, I like coming here once in a while, and seeing\nwhat everyone is doing. So, what’s bothering you?’\nArun replied, ‘You see, I need to grow my business more, but today I was\nnot feeling very well. If anything happened to me, who would look after my",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "large family?’\nYama nodded seriously. ‘Don’t worry, child,’ he comforted. ‘I have seen\nwhat a hard-working, kind- hearted person you are. You invited me home and\nlet me have a meal with you, knowing me only to be a tired and weary\ntraveller. I will do one thing. when it is time for you to leave the earth and\ncome with me, like all living things have to do one day, I will not come all of\na sudden. I will let you know many days in advance, so you can prepare\nyourself and your affairs for the time you have to go away with me.’\nArun bowed to the lord in gratitude when he heard this and Yama vanished.\nYears went by. Arun became an old man. His business had grown many\ntimes over, his children and brothers and sisters were all well looked after. He\nhad few worries left.\nOne night, he went to bed and had a dream. He saw Yama standing in front\nof him. Yama was holding out a hand towards him and saying, ‘Come, it is\ntime for you to go away with me.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "time for you to go away with me.’\nArun was terrified. ‘But lord, you had promised you would tell me days in\nadvance before I would die. How can I come away right now?’\nA small smile appeared on Yama’s lips. ‘But child, I did give you a\nwarning. I made your hair turn white, I made your back stoop with age, I\nmade your teeth fall out one by one. These were all indications that your time\non earth is coming to an end.’\n‘But these things happen to every man and woman! How could these be a\nwarning only for me!’\nYama nodded, ‘Yes, they do happen to everyone. And when they do, men\nand women should start getting ready to meet me. Life has to come to an end,\nthere is no escape.’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Arun now understood. He looked back on his days and realized that even\nwithout meaning to, he had been preparing for this. His children looked after\nhis business, all his work was done. There was nothing stopping him from\ngoing away with his old friend Yama.\nHe climbed on the buffalo behind Yama. ‘Let’s go,’ he said. And off Yama\nwent away with him.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "The Unending Story\nToday Ajja, Ajji and Vishnu Kaka were all feeling sad. The children’s\nholidays were nearly over, and it was nearing the time when they would go\nback to their homes. For three weeks the houses had echoed with their\nlaughter, games and quarrels. Now all would be quiet once again, till they\nreturned for the next holiday. The children too were feeling sad, and had\ngathered around their grandparents in a tight little group. Raghu the eldest\nsaid, ‘We had more fun this holiday then we’ve ever had. Even more than\nwhen we visited Disneyland. And it was all because of the stories.’\nAjja said, ‘When I was still working as a schoolteacher, I always found it\nwas so much easier to get my students’ attention when I told the lessons in the\nform of stories.’\nAnand said, ‘I find it really boring to read history from a book. But if you\ntell us the stories from history I’m sure we will remember everything!’\nEveryone now turned their bright eyes on Ajji. ‘How can you tell us only",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Everyone now turned their bright eyes on Ajji. ‘How can you tell us only\none story even on this last day, Ajji! We want more!’ they clamoured.\nBut Ajji shook her head. ‘If you eat only pickles and laddoos will you be\nhealthy? Stories are like that. You can’t spend all your time listening to\nstories. Then it will be boring. Like the unending story that a king once had to\nhear.’\n‘I want a story! And that’s an order!’ shouted King Pratap Singh of\nMayanagar. King Pratap was only fifteen years old, and still a boy at heart. He",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "didn’t like being a king much, because he was supposed to be doing serious\nthings like keeping the law, listening to his people’s problems and all kinds of\ndreary things like that. The only part he liked about being a ruler was that\neveryone had to obey him! How he loved giving orders and making all kinds\nof demands. And what he loved the most was listening to stories! Every day,\nhe insisted on listening to at least ten stories. All the storytellers in his\nkingdom lined up at his court. They told him funny stories, scary stories,\nmagical stories and anything else that came to their mind. King Pratap\nlistened to all with rapt attention.\nHe loved stories and storytellers so much that whenever he heard a good\ntale he would shower the teller with gold, silver and all kinds of wonderful\npresents. His ministers sighed and shook their heads and tried to explain,\n‘Your Majesty, stories are all very well, but you should be listening to them",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘Your Majesty, stories are all very well, but you should be listening to them\nafter your work is done! Your people need you to do so many things for them.\nIf you spend all your time wrapped up in fantasies, how will the land\nprosper?’\nBut King Pratap paid no attention. It was stories he wanted, and stories he\nwould get. But how long could the people provide him with stories? Soon the\ntales began to dry out. Some tried to cleverly tell him ones they had related\nlong back, but Pratap was sharp as a needle. ‘I’ve heard that one! Off with his\nhead for repeating a story!’\nOh, how his ministers had to plead with him to pardon the culprits!\nFinally, disgusted with all the storytellers in his land, the king announced,\n‘I want someone to tell me a story that will go on and on, till I ask him to\nstop. Anyone who can do this will get half my kingdom as a prize!’\nHis ministers were even more horrified at this. Half the kingdom to some",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "His ministers were even more horrified at this. Half the kingdom to some\nwoolly-headed writer and teller of stories! How horrible! They all tried to\nshow the king the foolishness of his ways, but he was adamant. A story that\nlasted for days, even weeks, was what he wanted and that was that!\nSoon a long line of men and women appeared at his court. Each one wanted\nto win the big prize. But none of their stories were good enough for King\nPratap.\n‘Boring!’ he shouted at some.\n‘Rubbish!’ he yelled at others.\n‘Cock and bull!’ he bellowed at yet others.\nMeanwhile work on the kingdom’s affairs had come to a stop. All the\nministers were sitting wringing their hands and wondering how to bring back",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "their king to solving all the important issues. Finally the chief minister, who\nwas wise and clever, had an idea.\nThe next day, a scruffy, crazy-looking man turned up at the court. His hair\nwas in a mess, his clothes were half torn and on his feet he wore torn shoes\nfrom which his toes stuck out. He marched up to the palace and demanded to\nbe given an audience with the king. The guards sighed and let him in. They\nwere used to having all kinds of characters turning up at the gates wanting to\ntell stories to the king.\nThe old man was admitted into the king’s chamber. There he made himself\ncomfortable, drank a huge jug of water, and without introducing himself,\nstarted his story:\n‘This story begins in a humble farmer’s field. The farmer had toiled days\nand weeks and months and grown a bumper crop of sugar cane. He sold the\nsugar cane to the nearby sugar factory and they made sacks and sacks of sugar\nout of it. Everyone was so happy. All this sugar would be sold in the markets",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "out of it. Everyone was so happy. All this sugar would be sold in the markets\nand make everyone very rich! That year their children would get nice new\nclothes, their stores would be full of food and their wives would be very\nhappy with them!\n‘Now all that sugar had to be stored and kept carefully till the sacks could\nbe taken to the market to sell. The factory people poured the sugar into many\nsacks and lugged them into a storeroom. In the storeroom who would you\nfind, but a colony of ants. They had decided that building their house near\nsuch a ready supply of their favourite food was a very good idea, and were\nalways on the lookout for new batches of sugar to be stored there.\n‘No sooner had the sacks been kept than the lines of ants marched up to\nthem. They found little holes to make their way in and the first ant went into\nthe first bag of sugar, took one sugar crystal and went back.\n‘The next ant went into the bag and took a crystal and returned home.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "‘The next ant went into the bag and took a crystal and returned home.\n‘Another went into the bag and took a crystal and returned home.\n‘Yet another went into the bag and took a crystal and returned home . . .’\nSo on and on the storyteller droned. King Pratap found he had nearly dozed\noff, the day had passed by and he was still listening to the same story.\n‘Stop! Stop!’ he ordered. ‘I will listen to the rest of the story tomorrow.’\nThe next morning the old man turned up as usual and started from where he\nhad left off the previous day. ‘Yesterday I was telling you how the ants came\nand picked up the sugar crystals. Now the next ant went towards the bag of",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "sugar and took a crystal and went back home. Another went and took a sugar\ncrystal and returned home. Another ant . . .’\nThe story went on and on like this. Lunch and dinner passed by but nothing\nnew happened. By now King Pratap was bursting with rage. How dare anyone\ntell him such a boring story? ‘What kind of a story is this?’ he complained.\n‘What will happen next? What happened to the farmer?’",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "But the old man only smiled and said, ‘Have patience, Your Majesty. That\nyear the yield was very good and there were thousands of bags of sugar. I\nhave to tell you how the ants collected all the sugar.’\n‘Oh stop! Stop!’ Pratap shouted. ‘Stop this boring story at once!’\nThe man now stood up and said, ‘Fine, if you are ordering me to stop, I\nhave won the prize. Give me half your kingdom!’\nThe king was in a dilemma now. He had announced a competition and\nprize no doubt, but could he honestly give away half the kingdom to this\ncrazy-looking storyteller with his boring tales?\nAs he sat pondering, the man grinned even wider, and took off his dirty\nrobe, rubbed off the dirt from his face and shook back his shaggy white hair.\nEveryone was astonished. Why, this was the chief minister himself!\n‘Don’t worry, Your Majesty,’ the minister told his overjoyed king. ‘I did not\nwant half your kingdom. I only wanted to show you how you were wrong to",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "want half your kingdom. I only wanted to show you how you were wrong to\nneglect your work and listen to stories night and day. Your people deserve a\ngood king, someone who will work hard to look after them; someone who\nwill think of his own happiness only once his people are happy. That’s what\ngood kings do, you know. Not just giving orders and enjoying yourself.’\nPoor Pratap looked ashamed at this. Yes, he had been an extremely selfish\nking. From now on, story time was only at night, after all his work was done.\nSo that was how the summer holidays ended. Everyone packed their bags and\nreached the station. Their mothers had come to take them back home. Ajja,\nAjji, Vishnu Kaka, Damu, Rehmat Chacha—everyone had come to see them\noff. No one felt like leaving Ajji’s side and Meenu kept hugging her till she\nhad to board the train.\nSoon the train puffed out of the station. The children leaned out to wave\ntheir goodbyes. Slowly Shiggaon got left behind. But the children would",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "their goodbyes. Slowly Shiggaon got left behind. But the children would\ncontinue to remember their Ajja and Ajji and everyone else, and all the\nstories, which would remain with them forever. And they would be back,\nduring the next summer holidays, when they would hear so many more . . .",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "THE BEGINNING\nLet the conversation begin…\nFollow the Penguin Twitter.com@PenguinIndia\nKeep up-to-date with all our stories Youtube.com/PenguinIndia\nLike ‘Penguin Books’ on Facebook.com/PenguinIndia\nFind out more about the author and\ndiscover more stories like this at Penguinbooksindia.com",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "PUFFIN BOOKS\nPublished by the Penguin Group\nPenguin Books India Pvt. Ltd, 7th Floor, Infinity Tower C, DLF Cyber City,\nGurgaon 122 002, Haryana, India\nPenguin Group (USA) Inc., 375 Hudson Street, New York, New York 10014, USA\nPenguin Group (Canada), 90 Eglinton Avenue East, Suite 700, Toronto, Ontario,\nM4P 2Y3, Canada\nPenguin Books Ltd, 80 Strand, London WC2R 0RL, England\nPenguin Ireland, 25 St Stephen’s Green, Dublin 2, Ireland (a division of Penguin Books Ltd)\nPenguin Group (Australia), 707 Collins Street, Melbourne, Victoria 3008, Australia\nPenguin Group (NZ), 67 Apollo Drive, Rosedale, Auckland 0632, New Zealand\nPenguin Books (South Africa) (Pty) Ltd, Block D, Rosebank Office Park, \n181 Jan Smuts Avenue, Parktown North, Johannesburg 2193, South Africa\nPenguin Books Ltd, Registered Offices: 80 Strand, London WC2R 0RL, England\nFirst published in Puffin by Penguin Books India 2012\nwww.penguinbooksindia.com\nText copyright © Sudha Murty 2012\nIllustration copyright © Priya Kuriyan 2015",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "Text copyright © Sudha Murty 2012\nIllustration copyright © Priya Kuriyan 2015\nCover illustration by Priya Kuriyan\nAll rights reserved\nThis is a work of fiction. Names, characters, places and incidents are either the product of the author’s\nimagination or are used fictitiously and any resemblance to any actual person, living or dead, events or\nlocales is entirely coincidental.\nISBN 978-0-143-33362-3\nThis digital edition published in 2015.\ne-ISBN: 978-8-184-75603-6\nThis book is sold subject to the condition that it shall not, by way of trade or otherwise, be lent, resold,\nhired out, or otherwise circulated without the publisher’s prior written consent in any form of binding or\ncover other than that in which it is published and without a similar condition including this condition\nbeing imposed on the subsequent purchaser and without limiting the rights under copyright reserved\nabove, no part of this publication may be reproduced, stored in or introduced into a retrieval system, or",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        },
        {
            "text_preview": "transmitted in any form or by any means (electronic, mechanical, photocopying, recording or\notherwise), without the prior written permission of both the copyright owner and the above-mentioned\npublisher of this book.",
            "source": "RagAPINew/tmp\\5671843b-9284-4657-972a-ca3011b78b0b_common.txt"
        }
    ]
}